-- MySQL dump 10.13  Distrib 5.5.10, for osx10.6 (i386)
--
-- Host: localhost    Database: mml
-- ------------------------------------------------------
-- Server version	5.5.10

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `categories`
--

DROP TABLE IF EXISTS `categories`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `categories` (
  `id` bigint(11) NOT NULL DEFAULT '0',
  `parent_id` bigint(11) DEFAULT NULL,
  `name` varchar(100) DEFAULT NULL,
  `sel_rank` int(10) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_categories_categories` (`parent_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `categories`
--

LOCK TABLES `categories` WRITE;
/*!40000 ALTER TABLE `categories` DISABLE KEYS */;
INSERT INTO `categories` VALUES (1,13,'Amino Acid',2),(2,13,'Antioxidants',3),(3,13,'Bone & Joint Support',4),(4,13,'Brain Support',5),(5,13,'Fiber and Digestive Support',6),(6,13,'Herbal and Phyto Extract',7),(7,13,'Hormone Support',8),(8,13,'Immune ',9),(9,13,'Minerals',10),(10,13,'Vitamins',11),(11,13,'Weight and Glucose Management',12),(12,0,'Dispensed',13),(13,0,'Compound',1);
/*!40000 ALTER TABLE `categories` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `clinicians`
--

DROP TABLE IF EXISTS `clinicians`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `clinicians` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `full_name` varchar(500) DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `hospital_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clinicians`
--

LOCK TABLES `clinicians` WRITE;
/*!40000 ALTER TABLE `clinicians` DISABLE KEYS */;
INSERT INTO `clinicians` VALUES (3,'นพ. ศุภศักดิ์',216,215);
/*!40000 ALTER TABLE `clinicians` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `customers`
--

DROP TABLE IF EXISTS `customers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `customers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `clinician_id` int(11) DEFAULT NULL,
  `hospital_id` int(11) DEFAULT NULL,
  `account_name` varchar(500) DEFAULT NULL,
  `billing_address` varchar(500) DEFAULT NULL,
  `balance` decimal(20,4) DEFAULT NULL,
  `logo_url` varchar(500) DEFAULT NULL,
  `cutoff_date` int(11) DEFAULT NULL,
  `payment_date` int(11) DEFAULT NULL,
  `cutoff_date_2` int(11) DEFAULT NULL,
  `payment_date_2` int(11) DEFAULT NULL,
  `note` varchar(1000) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `customer_hospital` (`hospital_id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `customers`
--

LOCK TABLES `customers` WRITE;
/*!40000 ALTER TABLE `customers` DISABLE KEYS */;
INSERT INTO `customers` VALUES (4,NULL,215,'รพ. ทดสอบ','74 ประชาชื่น 30, ทดสอบ, ทดสอบ 10800',NULL,'',15,20,0,0,NULL);
/*!40000 ALTER TABLE `customers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `deliveries`
--

DROP TABLE IF EXISTS `deliveries`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `deliveries` (
  `id` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='D/O';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `deliveries`
--

LOCK TABLES `deliveries` WRITE;
/*!40000 ALTER TABLE `deliveries` DISABLE KEYS */;
/*!40000 ALTER TABLE `deliveries` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `delivery_items`
--

DROP TABLE IF EXISTS `delivery_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `delivery_items` (
  `id` int(11) NOT NULL,
  `delivery_id` int(11) DEFAULT NULL,
  `manufacturing_item_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `do_item` (`delivery_id`),
  KEY `manufacturing_id` (`manufacturing_item_id`),
  CONSTRAINT `do_item` FOREIGN KEY (`delivery_id`) REFERENCES `deliveries` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `manufacturing_id` FOREIGN KEY (`manufacturing_item_id`) REFERENCES `manufacturing_items` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `delivery_items`
--

LOCK TABLES `delivery_items` WRITE;
/*!40000 ALTER TABLE `delivery_items` DISABLE KEYS */;
/*!40000 ALTER TABLE `delivery_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hospitals`
--

DROP TABLE IF EXISTS `hospitals`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `hospitals` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(500) DEFAULT NULL,
  `contact_person` varchar(500) DEFAULT NULL,
  `tel_1` varchar(500) DEFAULT NULL,
  `fax` varchar(500) DEFAULT NULL,
  `province` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=216 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hospitals`
--

LOCK TABLES `hospitals` WRITE;
/*!40000 ALTER TABLE `hospitals` DISABLE KEYS */;
INSERT INTO `hospitals` VALUES (3,'﻿รพ.กรุงเทพ ','นพ.สมชาย จันทร์สว่าง ','โทร. 0-2318-0066 ','โทรสาร. 0-2310-3327 ','กรุงเทพมหานคร\r'),(4,'รพ.กรุงเทพคริสเตียน ','มัคนายก ดร.ทวีศักดิ์ มหชวโรจน์(รักษาการ) ','โทร. 0-2233-6981-7 ','โทรสาร. 0-2236-2911 ','กรุงเทพมหานคร\r'),(5,'รพ.กรุงธน ','พล.ร.ต.นพ.สุรเชษฐ สู่พานิช ','โทร. 0-2438-0041-5 ','โทรสาร. 0-2438-5642 ','กรุงเทพมหานคร\r'),(6,'รพ.กรุงธน2 ','นพ.ไศล สุขพันธ์โพธาราม ','โทร. 0-2847-6767 ','โทรสาร. 0-2427-4070 ','กรุงเทพมหานคร\r'),(7,'รพ.กรุณาพิทักษ์ ','นพ.สุวัฒน์ วิทยาคม ','โทร. 0-22866793-5 ','โทรสาร. 0-2678-3004 ','กรุงเทพมหานคร\r'),(8,'รพ.กล้วยน้ำไท ','คุณพูลชัย ชเนศร์ ','โทร. 0-2769-2000 ','โทรสาร. 0-2381-2769 ','กรุงเทพมหานคร\r'),(9,'รพ.เกษมราษฎร์สุขาภิบาล3 ','นพ.ฐิติ พัฒนกำจร ','โทร. 0-2729-3000 ','โทรสาร. 0-2729-5050 ','กรุงเทพมหานคร\r'),(10,'รพ.เกษมราษฎร์ บางแค ','นพ.สุวิทย์ โฆษิตสุรังคกุล ','โทร. 0-2454-1915-8 ','โทรสาร. 0-2454-1914 ','กรุงเทพมหานคร\r'),(11,'รพ.เกษมราษฎร์ ประชาชื่น ','นพ.ธวัชชัย วานิชกร ','โทร. 0-2910-1600 ','โทรสาร. 0-2910-1649 ','กรุงเทพมหานคร\r'),(12,'รพ.คามิลเลียน ','นพ.ชัยพฤกษ์ ปิยะเกศิน ','โทร. 0-2391-0136 ','โทรสาร. 0-2185-1403 ','กรุงเทพมหานคร\r'),(13,'รพ.จักษุ รัตนิน ','นพ.นพรัตน์ สุจริตจันทร์ ','โทร. 0-2258-0442-5 ','โทรสาร. 0-2259-0780 ','กรุงเทพมหานคร\r'),(14,'รพ.เจตนิน ','นพ.จงเจตน์ อาวเจนพงษ์ ','โทร. 0-2655-5300-10 ','โทรสาร. 0-2655-5313 ','กรุงเทพมหานคร\r'),(15,'รพ.เจ้าพระยา ','นพ.จำเริญ สรพิพัฒน์ ','โทร. 0-2434-6900 ','โทรสาร. 0-2434-6929 ','กรุงเทพมหานคร\r'),(16,'รพ.เซนต์คาร์ลอส ','นพ.สุชัย หยองอนุกูล์ ','โทร. 0-2274-0616-20 ','โทรสาร. 0-2274-0621 ','กรุงเทพมหานคร\r'),(17,'รพ.เซนต์หลุยส์ ','ศ.นพ.จิตร สิทธิอมร ','โทร. 0-2675-5000 ','โทรสาร. 0-2675-5200 ','กรุงเทพมหานคร\r'),(18,'รพ.เซ็นทรัลเยนเนอรัล ','พญ.ลักษมี ว่องกุศลกิจ ','โทร. 0-2552-8801-10 ','โทรสาร. 0-2552-0666 ','กรุงเทพมหานคร\r'),(19,'รพ.เดชา ','นพ.สราวุธ อนันต์เศรษฐกุล ','โทร. 0-2246-0137 ','โทรสาร. 0-2247-2089 ','กรุงเทพมหานคร\r'),(20,'รพ.ตา หู คอ จมูก ','นพ.ศุภชัย โชติบุตร ','โทร. 0-2433-3601-3 ','โทรสาร. 0-2433-3613 ','กรุงเทพมหานคร\r'),(21,'รพ.เทพธารินทร์ ','ศ.นพ.เทพ หิมะทองคำ ','โทร. 0-2240-2727 ','โทรสาร. 0-2249-8774 ','กรุงเทพมหานคร\r'),(22,'รพ.ไทยนครินทร์ ','นพ.เจริญ มีนสุข ','โทร. 0-2361-2727 ','โทรสาร. 0-2361-2777 ','กรุงเทพมหานคร\r'),(23,'รพ.ธนบุรี ','คุณเฉลิมกุล อภิกุลโอภาส ','โทร. 0-2411-0401-7 ','โทรสาร. 0-2412-8214 ','กรุงเทพมหานคร\r'),(24,'รพ.นครธน ','นพ.วิโรจน์ ตระการวิจิตร ','โทร. 0-2416-5454 ','โทรสาร. 0-2415-4340 ','กรุงเทพมหานคร\r'),(25,'รพ.นวมินทร์ ','นพ.ประจักษ์ บุญจิตต์พิมล ','โทร. 0-2918-7604-8 ','โทรสาร. 0-2918-9192 ','กรุงเทพมหานคร\r'),(26,'รพ.นวมินทร์ 9 ','นพ.อรรคพาสน์ โอวาทตระกูล ','โทร. 0-2518-1818 ','โทรสาร. 0-2518-2112 ','กรุงเทพมหานคร\r'),(27,'รพ.บางกอก 9 อินเตอร์เนชั่นแนล ','พญ..เจรียง จันทรกมล ','โทร. 0-2877-1111 ','โทรสาร. 0-2877-1111 ','กรุงเทพมหานคร\r'),(28,'รพ.บางกอกเนอสซิ่งโฮม ','พญ.ลินดา ไกรวิทย์ ','โทร. 0-2632-0550 ','โทรสาร. 0-2632-0578 ','กรุงเทพมหานคร\r'),(29,'รพ.บางนา ','นพ.ชุตินันท์ พรมมินทร์ ','โทร. 0-2393-8534 ','โทรสาร. 0-2398-9531 ','กรุงเทพมหานคร\r'),(30,'รพ.บางปะกอก 1 ','นพ.วีระ อิงคภาสกร ','โทร. 0-2872-1111 ','โทรสาร. 0-2872-1065 ','กรุงเทพมหานคร\r'),(31,'รพ.บางปะกอก 2 บางบอน ','นพ.มานิตย์ จารุวรรณ ','โทร. 0-2899-0130-9 ','โทรสาร. 0-2451-0357 ','กรุงเทพมหานคร\r'),(32,'รพ.บางไผ่ ','พญ.ศศิธร พงษ์สามารถ ','โทร. 0-2457-0086 ','โทรสาร. 0-2457-2215 ','กรุงเทพมหานคร\r'),(33,'รพ.บางโพ ','นพ.เกตุ สายเพชร์ ','โทร. 0-2587-0136 ','โทรสาร. 0-2586-0024 ','กรุงเทพมหานคร\r'),(34,'รพ.บางมด ','นพ.สุรสิทธิ์ อัศดามงคล ','โทร. 0-2416-0049 ','โทรสาร. 0-2415-6864 ','กรุงเทพมหานคร\r'),(35,'รพ.บำรุงราษฎร์ ','คุณแม็ค แบนเนอร์ ','โทร. 0-2667-1000 ','โทรสาร. 0-2667- 2525 ','กรุงเทพมหานคร\r'),(36,'รพ.บีแคร์ ','รออ.นพ.พิทักษ์ ฐานบัญชา ','โทร. 0-2523-3359-71 ','โทรสาร. 0-2523-3372 ','กรุงเทพมหานคร\r'),(37,'รพ.ปิยะเวท ','  ','โทร. 0-2625-6500 ','โทรสาร. 0-2246-9253 ','กรุงเทพมหานคร\r'),(38,'รพ.เปาโล เมโมเรียล ','นพ.พิชัย แพร่ภัทร ','โทร. 0-2279-4302 ','โทรสาร. 0-2279-4303 ','กรุงเทพมหานคร\r'),(39,'รพ.เปาโล เมโมเรียล โชคชัย 4 ','นพ.นพรัตน์ โง้วจุงดี ','โทร. 0-2514-2273-5 ','โทรสาร. 0-2538-3606 ','กรุงเทพมหานคร\r'),(40,'รพ.พญาไท 1 ','คุณไกรวิน ศรีไกรวิน ','โทร. 0-2245-2620-8 ','โทรสาร. 0-2640-1109 ','กรุงเทพมหานคร\r'),(41,'รพ.พญาไท 2 ','คุณธนา ถิรมนัส ','โทร. 0-2617-2444 ','โทรสาร. 0-2619-8541 ','กรุงเทพมหานคร\r'),(42,'รพ.พญาไท 3 ','นพ.อนันตศักดิ์ อภัยรัตน์ ','โทร. 0-2869-1220-2 ','โทรสาร. 0-2467-6505 ','กรุงเทพมหานคร\r'),(43,'รพ.พระราม 2 ','นพ.ปรีชา เลิศศิวาพร ','โทร. 0-2451-4920 ','โทรสาร. 0-2451-4599 ','กรุงเทพมหานคร\r'),(44,'รพ.พระรามเก้า ','นพ.เสถียร ภู่ประเสริฐ ','โทร. 0-2248-8026 ','โทรสาร. 0-2248-8018 ','กรุงเทพมหานคร\r'),(45,'รพ.เพชรเกษม-บางแค ','นพ.พิชิต ยิ่งเจริญ ','โทร. 0-2801-1199 ','โทรสาร. 0-2801-2299 ','กรุงเทพมหานคร\r'),(46,'รพ.เพชรเวช ','นพ.ชนะ ตันจันทร์พงษ์ ','โทร. 0-2318-0080-1 ','โทรสาร. 0-2318-1986 ','กรุงเทพมหานคร\r'),(47,'รพ.แพทย์ปัญญา ','นพ.สวัสดิ์ เถกิงเดช ','โทร. 0-2314-0726-9 ','โทรสาร. 0-2319-6685 ','กรุงเทพมหานคร\r'),(48,'รพ.มงกุฎวัฒนะ ','นพ.เหรียญทอง แน่นหนา ','โทร. 0-2574-5000-9 ','โทรสาร. 0-2574-4856 ','กรุงเทพมหานคร\r'),(49,'รพ.มเหสักข์ ','นพ.ชูเกียรติ ศุภนันตฤกษ์ ','โทร. 0-2635-7123-7 ','โทรสาร. 0-2233-7433 ','กรุงเทพมหานคร\r'),(50,'รพ.มิชชั่น ','คุณสมชัย ชื่นจิตร ','โทร. 0-2281-1422 ','โทรสาร. 0-2628-1752 ','กรุงเทพมหานคร\r'),(51,'รพ.เมโย ','นพ.ภาวิต ปุญญฤทธ์ ','โทร. 0-2579-1770-4 ','โทรสาร. 0-2579-9676 ','กรุงเทพมหานคร\r'),(52,'รพ.ยันฮี ','นพ. เกริกยศ ชลายนเดชะ ','โทร. 0-2434-9196-9 ','โทรสาร. 0-2435-7545 ','กรุงเทพมหานคร\r'),(53,'รพ.เยาวรักษ์ ','นพ.ธวัชชัย เจริญวงศ์ ','โทร. 0-2466-1963 ','โทรสาร. 0-2465-5919 ','กรุงเทพมหานคร\r'),(54,'รพ.รามคำแหง ','ทพ.เจิมพล ภูมิตระกูล ','โทร. 0-2374-0200-16 ','โทรสาร. 0-2374-0804 ','กรุงเทพมหานคร\r'),(55,'รพ.ราษฎร์บูรณะ ','คุณนิตยา ปรีชายุทธ ','โทร. 0-2427-0175-9 ','โทรสาร. 0-2427-3030 ','กรุงเทพมหานคร\r'),(56,'รพ.ลาดพร้าว ','นพ.วรพงศ์ จูตะวิริยะ ','โทร. 0-2530-2244 ','โทรสาร. 0-2539-8490 ','กรุงเทพมหานคร\r'),(57,'รพ.วิชัยยุทธ ','พล.ท.นพ.ณรงค์ รอดวรรณะ ','โทร. 0-2271-0125-9 ','โทรสาร. 0-2272-2788 ','กรุงเทพมหานคร\r'),(58,'รพ.วิภาวดี ','พล.ท.นพ.พร้อมพงษ์ พีระบูล ','โทร. 0-2561-1258-67 ','โทรสาร. 0-2561-1462 ','กรุงเทพมหานคร\r'),(59,'รพ.วิภาราม ','นพ.ไพบูลย์ เอกแสงศรี ','โทร. 0-2722-2500 ','โทรสาร. 0-2722-2445 ','กรุงเทพมหานคร\r'),(60,'รพ.เวชธานี ','ร.อ.ชาคริต ศึกษากิจ ','โทร. 0-2734-0000 ','โทรสาร. 0-2734-0376 ','กรุงเทพมหานคร\r'),(61,'รพ.ศรีวิชัย 1 ','นพ.ถนอมชัย คู่ทวีธรรม ','โทร. 0-2412-0055-60 ','โทรสาร. 0-2412-7582 ','กรุงเทพมหานคร\r'),(62,'รพ.ศรีวิชัย 2 ','นพ.สุรพล โล่สิริวัฒน์ ','โทร. 0-2441-6999 ','โทรสาร. 0-2421-1784 ','กรุงเทพมหานคร\r'),(63,'รพ.เปาโลเมโมเรียล นวมินทร์ ','นพ.นิพนธ์ ธีราโมก ','โทร. 0-2944-7111 ','โทรสาร. 0-2944-8060 ','กรุงเทพมหานคร\r'),(64,'รพ.ศิครินทร์ ','นพ.ธงชัย ฉัตรยิ่งมงคล ','โทร. 0-2383-4391-9 ','โทรสาร. 0-2383-4414 ','กรุงเทพมหานคร\r'),(65,'รพ.ศูนย์มะเร็งกรุงเทพฯ ','นพ.เทอดศักดิ์ ปรมากูล ','โทร. 0-2278-5716 ','โทรสาร. 0-2278-0274 ','กรุงเทพมหานคร\r'),(66,'รพ.สมิติเวช สุขุมวิท ','นพ.โชคชัย จารุศิริพิพัฒน์ ','โทร. 0-2392-0011 ','โทรสาร. 0-2391-1290 ','กรุงเทพมหานคร\r'),(67,'รพ.สมิติเวชศรีนครินทร์ ','นพ.ดุลย์ ดำรงศักดิ์ ','โทร. 0-2378-9277 ','โทรสาร. 0-2731-7358 ','กรุงเทพมหานคร\r'),(68,'รพ.สายไหม ','น.ท.พญ.ลักษมี ว่องกุศลกิจ ','โทร. 0-2991-8999 ','โทรสาร. 0-2563-5222 ','กรุงเทพมหานคร\r'),(69,'รพ.สินแพทย์ ','นพ.ศิริพงษ์ เหลืองวารินกุล ','โทร. 0-2948-5380-90 ','โทรสาร. 0-2948-5816 ','กรุงเทพมหานคร\r'),(70,'รพ.สุขุมวิท ','นพ.ดาวิน นารูลา ','โทร. 0-2391-0011 ','โทรสาร. 0-2714-0081 ','กรุงเทพมหานคร\r'),(71,'รพ.หัวเฉียว ','นพ.พรชัย ตั้งลัคนวาณิชย์ ','โทร. 0-2223-1351 ','โทรสาร. 0-2223-1351 ','กรุงเทพมหานคร\r'),(72,'รพ.มนารมย์ ','นพ.ไกรสิทธิ์ นฤขัตพิชัย ','โทร. 0-2725-9595 ','โทรสาร. 0-2725-9599 ','กรุงเทพมหานคร\r'),(73,'รพ.เกษมราษฎร์รัตนาธิฯ ','นพ.ตุลวรรธน์ พัชราภา ','โทร. 0-2594-0020-6 ','โทรสาร. 0-2594-0067 ','นนทบุรี\r'),(74,'รพ.แม่น้ำ ','คุณกมลวรรณ ลักษณะกาญจน์ ','โทร. 0-2960-9655 ','โทรสาร. 0-2960-9666 ','นนทบุรี\r'),(75,'รพ.นนทเวช ','นพ.พรมพันธ์ พรมมาส ','โทร. 0-2589-5490-1 ','โทรสาร. 0-2589-8753 ','นนทบุรี\r'),(76,'รพ.อนันต์พัฒนา 2 ','นพ.อนันต์ ธรรมจำรัสศรี ','โทร. 0-2883-9922 ','โทรสาร. 0-2883-9990 ','นนทบุรี\r'),(77,'รพ.กรุงสยามเซนต์คาร์ลอส ','นพ.สุชัย หยองอนุกูล ','โทร. 0-2975-6700 ','โทรสาร. 0-2998-9000 ','ปทุมธานี\r'),(78,'รพ.แพทย์รังสิต ','นพ.กฤชรัตน์ ตระกูลช่าง ','โทร. 0-2531-2151-60 ','โทรสาร. 0-2531-3589 ','ปทุมธานี\r'),(79,'รพ.ภัทร-ธนบุรี ','คุณพูนศักดิ์ จรูญศิริ ','โทร. 0-2901-8400-8 ','โทรสาร. 0-2901-8082 ','ปทุมธานี\r'),(80,'รพ.เอกปทุม ','นพ.สุนทร อันตรเสน ','โทร. 0-2996-2211-15 ','โทรสาร. 0-2996-2207 ','ปทุมธานี\r'),(81,'รพ.นวนครการแพทย์ ','นพ.ส่งเสริม พานิชาภรณ์ ','โทร. 0-2529-4533 ','โทรสาร. 0-2909-2223 ','ปทุมธานี\r'),(82,'รพ.ปทุมเวช ','นพ.สุธีร์ สทุมถิระ ','โทร. 0-2567-1991-9 ','โทรสาร. 0-2958-4528 ','ปทุมธานี\r'),(83,'รพ.ราชธานี ','นพ.บุญชัย อิศราพิสิษฐ์ ','โทร. 0-3533-5555 ','โทรสาร. 0-3533-5555 ','พระนครศรีอยุธยา\r'),(84,'รพ.ศุภมิตรเสนา ','คุณวิโรจน์ อภิสิทธิ์วิทยา ','โทร. 0-3528-9572-7 ','โทรสาร. 0-3528-9583 ','พระนครศรีอยุธยา\r'),(85,'รพ.กรุงเทพพระประแดง ','นพ.ณรงค์ฤทธิ์ ฮาวรังษี ','โทร. 0-2425-0029 ','โทรสาร. 0-2815-7151 ','สมุทรปราการ\r'),(86,'รพ.จุฬารัตน์ ','นพ.กำพล พลัสสินทร์ ','โทร. 0-2316-6198-9 ','โทรสาร. 0-2750-5146 ','สมุทรปราการ\r'),(87,'รพ.จุฬารัตน์ 3 ','นพ.กำพล พลัสสินทร์ ','โทร. 0-2769-2900 ','โทรสาร. 0-2769-2997 ','สมุทรปราการ\r'),(88,'รพ.จุฬารัตน์ 9 ','นพ.ยุทธนา สงวนศักดิ์โกศล ','โทร. 0-2738-9900-9 ','โทรสาร. 0-2738-9740 ','สมุทรปราการ\r'),(89,'รพ.ชัยปราการ ','นพ.ภาสกร รักษ์กุล ','โทร. 0-2363-9222 ','โทรสาร. 0-2394-4237 ','สมุทรปราการ\r'),(90,'รพ.เซ็นทรัลปาร์ค ','นพ.อนันต์ อธิพันธุ์อำไพ ','โทร. 0-2312-7261-9 ','โทรสาร. 0-2750-9735 ','สมุทรปราการ\r'),(91,'รพ.บางปะกอก 3 ','นพ.นิคม ศิริชัย ','โทร. 0-2818-7555 ','โทรสาร. 0-2818-7509 ','สมุทรปราการ\r'),(92,'รพ.ปิยะมินทร์ ','นพ.ต่อพงศ์ อัศวิษณุ ','โทร. 0-2316-0026-7 ','โทรสาร. 0-2316-0062 ','สมุทรปราการ\r'),(93,'รพ.เมืองสมุทร ','นพ.พิพัฒน์ พงศ์รัตนามาน ','โทร. 0-2173-7772 ','โทรสาร. 0-2173-7783 ','สมุทรปราการ\r'),(94,'รพ.เมืองสมุทรปู่เจ้าฯ ','นพ.พิพัฒน์ พงศ์รัตนามาน ','โทร. 0-2754-2800-9 ','โทรสาร. 0-2754-2514 ','สมุทรปราการ\r'),(95,'รพ.รวมชัยประชารักษ์ ','คุณธนวัฒน์ ทวีชัยถาวร ','โทร. 0-2708-7500-10 ','โทรสาร. 0-2708-7542 ','สมุทรปราการ\r'),(96,'รพ.รัทรินทร์ ','นพ.เขตโสภณ จัตวัฒนกุล ','โทร. 0-2323-2991-9 ','โทรสาร. 0-23232985 ','สมุทรปราการ\r'),(97,'รพ.เปาโลเมโมเรียล สมุทรปราการ ','นพ.โอภาส สินเพิ่มสุขสกุล ','โทร. 0-2389-2555 ','โทรสาร. 0-2389-4916 ','สมุทรปราการ\r'),(98,'รพ.สำโรงการแพทย์ ','นพ.ศิริพงษ์ วิทยเลิศปัญญา ','โทร. 0-2361-0070-9 ','โทรสาร. 0-2756-8465 ','สมุทรปราการ\r'),(99,'รพ.รวมแพทย์ ชัยนาท ','นพ.สุเทพ วัตถุศิลป์ ','โทร. 0-5641-3017-8 ','โทรสาร. 0-5641-3019 ','ชัยนาท\r'),(100,'รพ.สุวรรณเวช ','นพ.พงษ์เทพ เลิศสุวรรณสิทธิ์ ','โทร. 0-5645-1400 ','โทรสาร. 056-451-440 ','ชัยนาท\r'),(101,'รพ.เบญจรมย์ ','นพ.วราศักดิ์ ไกรฤกษ์ ','โทร. 0-3641-3933 ','โทรสาร. 0-3661-0515 ','ลพบุรี\r'),(102,'รพ.เมืองนารายณ์ ','พญ.วรินทร อัศวนิก ','โทร. 0-3661-6300 ','โทรสาร. 0-3661-6301 ','ลพบุรี\r'),(103,'รพ.เกษมราษฎร์ สระบุรี ','นพ.สมเจษฎ์ ไกรโรจนานันท์ ','โทร. 0-3631-5555 ','โทรสาร. 0-3631-5501 ','สระบุรี\r'),(104,'รพ.มิตรภาพ เมโมเรียล ','นพ.พนม สนิทประชากร ','โทร. 0-3621-2131-4 ','โทรสาร. 0-3622-2197 ','สระบุรี\r'),(105,'รพ.คริสเตียนไชยวัฒน์ ','คุณไชยวัฒน์ วีระสมบัติ ','โทร. 0-3658-1294 ','โทรสาร. 0-3658-1296 ','สิงหบุรี\r'),(106,'รพ.สิงห์บุรีเวชการ ','นพ.ประเจิด สุรีย์จามร ','โทร. 0-3652-0517 ','โทรสาร. 0-3651-2784 ','สิงหบุรี\r'),(107,'รพ.ธนบุรี-อู่ทอง ','นพ.วิวัฒน์ กิตติวัฒนโชติ ','โทร. 0-3540-4053-9 ','โทรสาร. 0-3555-2890 ','สุพรรณบุรี\r'),(108,'รพ.หมอสำเริง ','นพ.สำเริง ศรีผุดผ่อง ','โทร. 0-3557-8959 ','โทรสาร. 0-3557-8959 ','สุพรรณบุรี\r'),(109,'รพ.พรชัย ','นพ.บุญชัย บุญแสง ','โทร. 0-3550-3531-5 ','โทรสาร. 0-3550-3432 ','สุพรรณบุรี\r'),(110,'รพ.ศุภมิตร ','นพ.เมธ โชคชัยชาญ ','โทร. 0-3550-0283-8 ','โทรสาร. 0-3550-1406 ','สุพรรณบุรี\r'),(111,'รพ.ปิยราษฎร์ ','นพ.ทรงกิจ สุทธิกาญจน์ ','โทร. 0-3555-2724-8 ','โทรสาร. 0-3555-2665 ','สุพรรณบุรี\r'),(112,'รพ.กรุงเทพจันทบุรี ','นพ.จารุวัฑ ใช้ความเพียร ','โทร. 0-3935-1467 ','โทรสาร. 0-3932-1202 ','จันทบุรี\r'),(113,'รพ.สิริเวช ','นพ.กำธร ศิริธัญญาลักษณ์ ','โทร. 0-3934-4244 ','โทรสาร. 0-3932-2995 ','จันทบุรี\r'),(114,'รพ.จุฬารัตน์ 11 ','พญ.ชุติมา ปิ่นเจริญ ','โทร. 0-3853-8511-3 ','โทรสาร. 0-3853-8798 ','ฉะเชิงเทรา\r'),(115,'รพ.โสธราเวช ','นพ.การุณ พุทธภาวนา ','โทร. 0-3881-2702-19 ','โทรสาร. 0-3881-2720 ','ฉะเชิงเทรา\r'),(116,'รพ.กรุงเทพพัทยา ','นพ.พิชิต กังวลกิจ ','โทร. 0-3825-9999 ','โทรสาร. 0-3872-7307 ','ชลบุรี\r'),(117,'รพ.ชลเวช ','พญ.วิมล สุรินทราบูรณ์ ','โทร. 0-3828-4354-5 ','โทรสาร. 0-3827-1990 ','ชลบุรี\r'),(118,'รพ.พญาไทศรีราชา ','นพ.ธนาคม แมนธนานนท์ ','โทร. 0-3877-0200-8 ','โทรสาร. 0-3877-0213 ','ชลบุรี\r'),(119,'รพ.พัทยาเมโมเรียล ','นพ.สมเกียรติ ธนไพศาลพิพัฒน์ ','โทร. 0-3848-8777 ','โทรสาร. 0-3842-2740 ','ชลบุรี\r'),(120,'รพ.พัทยาอินเตอร์ ','คุณอุไรวรรณ เทพนมรัตน์ ','โทร. 0-3842-8374-5 ','โทรสาร. 0-3842-2773 ','ชลบุรี\r'),(121,'รพ.สมิติเวช ศรีราชา ','นพ.ชัยรัตน์ ปัณฑุรอัมพร ','โทร. 0-3832-4100-11 ','โทรสาร. 0-3832-4123 ','ชลบุรี\r'),(122,'รพ.แหลมฉบังอินเตอร์ ','ผศ.รังสรรค์ สุฉันทบุตร ','โทร. 0-3849-1888 ','โทรสาร. 0-3849-1878 ','ชลบุรี\r'),(123,'รพ.เอกชล ','นพ.จรัล ใจแพทย์ ','โทร. 0-3827-3840 ','โทรสาร. 0-3827-3848 ','ชลบุร\r'),(124,'รพ.เอกชล 2 ','นพ.สานิตย์ ชากฤษณ์ ','โทร. 0-3893-9888 ','โทรสาร. 0-3893-9800 ','ชลบุร\r'),(125,'รพ.กรุงเทพตราด ','พญ.สุดจิต ลิขสิทธิ์ศุภการ ','โทร. 0-3953-2735 ','โทรสาร. 0-3953-2599 ','ตราด\r'),(126,'รพ.มงกุฎ ระยอง ','นพ.นิยม สลิสอำไพ ','โทร. 0-3868-2136-9 ','โทรสาร. 0-3868-1459 ','ระยอง\r'),(127,'รพ.รวมแพทย์ระยอง ','นพ.กริช สัตยบุตร ','โทร. 0-3886-0890-3 ','โทรสาร. 0-3886-1279 ','ระยอง\r'),(128,'รพ.กรุงเทพคริสเตียน ','นพ.วิโรจน์ ดิเรกสถาพร ','โทร. 0-3421-3453-60 ','โทรสาร. 0-3427-0088 ','นครปฐม\r'),(129,'รพ.เทพากร ','นพ.วรวิทย์ วัชโรทยางกูร ','โทร. 0-3421-2718-26 ','โทรสาร. 0-34241-314 ','นครปฐม\r'),(130,'รพ.ศาลายา ','นพ.จรัสพงษ์ ทังสุบุตร ','โทร. 0-2889-2601-7 ','โทรสาร. 0-2889-3550 ','นครปฐม\r'),(131,'รพ.สนามจันทร์ ','นพ.ทรงชัย ศรีโรจนกุล ','โทร. 0-3421-9600 ','โทรสาร. 0-3421-7817 ','นครปฐม\r'),(132,'รพ.ซาน เปา โล หัวหิน ','นพ.เอกลาภ ทองบริสุทธิ์ ','โทร. 0-3253-2576 ','โทรสาร. 0-3253-2582 ','ประจวบคีรีขันธ์\r'),(133,'รพ.เมืองเพชร-ธนบุรี ','ภญ.รพีพร กิตติวงศ์โสภณ ','โทร. 0-3241-5191-9 ','โทรสาร. 0-3241-5188 ','เพชรบุรี\r'),(134,'รพ.เพชรรัชต์ ','นพ.สัมฤทธิ์ สินธัญญาธรรม ','โทร. 0-3241-7070-9 ','โทรสาร. 0-3241-1689 ','เพชรบุรี\r'),(135,'รพ.ซานคามิลโล ','คุณจิรวัฒน์ สุจิรานุธรรม ','โทร. 0-3221-1143 ','โทรสาร. 0-3220-1256 ','ราชบุรี\r'),(136,'รพ.พร้อมแพทย์ ','นพ.ประสงค์ ประภาวงศ์ ','โทร. 0-3231-5234-9 ','โทรสาร. 0-3231-5385 ','ราชบุรี\r'),(137,'รพ.เมืองราช ','นพ.กมิล ปั้นประสงค์ ','โทร. 0-3232-2274-80 ','โทรสาร. 0-3231-2685-6 ','ราชบุรี\r'),(138,'รพ.แม่กลอง 2 ','พญ.สุวรรณา ชูพิศาลยโรจน์ ','โทร. 0-3471-5001-5 ','โทรสาร. 0-34718679 ','สมุทรสงคราม\r'),(139,'รพ.มหาชัย ','นพ.อิทธิ ฉันศิริกาญจน ','โทร. 0-3442-4990 ','โทรสาร. 0-3481-0778 ','สมุทรสาคร\r'),(140,'รพ.มหาชัย 2 ','พญ.ดาวัลย์ อนุวุฒินาวิน ','โทร. 0-2810-3442 ','โทรสาร. 0-2420-0251 ','สมุทรสาคร\r'),(141,'รพ.ศรีวิชัย 3 ','นพ.พงษ์ศักดิ์ วัฒนา ','โทร. 0-2431-0070 ','โทรสาร. 0-2431-0940 ','สมุทรสาคร\r'),(142,'รพ.ศรีวิชัย 5 ','พญ.สายสุนี วรรณดุรงค์วรรณ ','โทร. 0-3482-6708 ','โทรสาร. 0-3482-6706 ','สมุทรสาคร\r'),(143,'รพ.เอกชัย ','นพ.เกรียงไกร จีระแพทย์ ','โทร. 0-3441-7999 ','โทรสาร. 0-3441-7903 ','สมุทรสาคร\r'),(144,'รพ.บัวใหญ่รวมแพทย์ ','นพ.โกวิท คำพิทักษ์ ','โทร. 0-4429-2249-53 ','โทรสาร. 0-4429-2252 ','นครราชสีมา\r'),(145,'รพ.ป.แพทย์ ','นพ.ประณีต สงวนตระกูล ','โทร. 0-4423-0530-3 ','โทรสาร. 0-4425-1120 ','นครราชสีมา\r'),(146,'รพ.กรุงเทพราชสีมา ','นพ.ธนรัชต์ สมุทรเพชร ','โทร. 0-4442-9999 ','โทรสาร. 0-4425-6421 ','นครราชสีมา\r'),(147,'รพ.เซ็นต์เมรี่ ','นพ.บรรพต พึ่งชัยพัฒน์ ','โทร. 0-4424-2385 ','โทรสาร. 0-4425-6600 ','นครราชสีมา\r'),(148,'รพ.เอกชนบุรีรัมย์ ','นพ.วรพงษ์ ศักดิ์ศิรินุกูล ','โทร. 0-4461-4100 ','โทรสาร. 0-4461-4110 ','บุรีรัมย์\r'),(149,'รพ.รวมแพทย์สุรินทร์(หมออนันต์) ','นพ.อิสระ อริยะชัยพาณิชย์ ','โทร. 0-4451-5700 ','โทรสาร. 0-4451-2496 ','สุรินทร์\r'),(150,'รพ.ธีรวัฒน์ ','นพ.ธีรวัฒน์ ร่มไทรทอง ','โทร. 0-4381-1757 ','โทรสาร. 0-4381-2142 ','กาฬสินธุ์\r'),(151,'รพ.ขอนแก่นราม ','นพ.สมชาย กิตติพงษ์หรรษา ','โทร. 0-4333-3901 ','โทรสาร. 0-4333-3899 ','ขอนแก่น\r'),(152,'รพ.ราชพฤกษ์ ','นพ.ธีระวัฒน์ ศรีนัครินทร์ ','โทร. 0-4333-3555 ','โทรสาร. 0-4323-8833 ','ขอนแก่น\r'),(153,'รพ.เวชประสิทธิ์ ','คุณอนัญพร พูลนิติพร ','โทร. 0-4324-5544 ','โทรสาร. 0-4324-5644 ','ขอนแก่น\r'),(154,'รพ.เมืองเลยราม ','นพ.บุญชัย จิตตนาสวัสดิ์ ','โทร. 0-4283-3400 ','โทรสาร. 0-4283-2522 ','เลย\r'),(155,'รพ.รักษ์สกล ','คุณสมคิด ปิยะธรรมวุฒิกุล ','โทร. 0-4271-2800 ','โทรสาร. 0-4271-2584 ','สกลนคร\r'),(156,'รพ.นอร์ทอีสเทร์น-วัฒนา ','พญ.ศุภวรรณ ตั้งสืบกุล ','โทร. 0-4224-1031-3 ','โทรสาร. 0-4224-1956 ','อุดรธานี\r'),(157,'รพ.ปัญญาเวช ','นพ.ปัญญา อยู่ประเสริฐ ','โทร. 0-4234-3111 ','โทรสาร. 0-4234-3065 ','อุดรธานี\r'),(158,'รพ.เอกอุดร ','คุณวิเชียร ชมดง ','โทร. 0-4234-2555 ','โทรสาร. 0-4234-1033 ','อุดรธานี\r'),(159,'รพ.มุกดาหารอินเตอร์ ','นพ.ธีระยุทธ นิยากูล ','โทร. 0-4263-3301-9 ','โทรสาร. 0-4263-3310 ','มุกดาหาร\r'),(160,'รพ.นายแพทย์หาญ ','นพ.หาญ สุฉันทบุตร ','โทร. 0-4571-1356 ','โทรสาร. 0-4571-1020 ','ยโสธร\r'),(161,'รพ.ยโสธรรวมแพทย์ ','นพ.หาญ สุฉันทบุตร ','โทร. 0-4571-2141-2 ','โทรสาร. 0-4572-0378 ','ยโสธร\r'),(162,'รพ.กรุงเทพจุรีเวช ','พญ.กฤษณา โฆษิตจิรนันท์ ','โทร. 0-4352-7111 ','โทรสาร. 0-4352-7699 ','ร้อยเอ็ด\r'),(163,'รพ.ประชารักษ์ ','ภก.สมพร จึงศิรกุลวิทย์ ','โทร. 0-4563-1313 ','โทรสาร. 0-4561-4202 ','ศรีสะเกษ\r'),(164,'รพ.อุบลรักษ์ ธนบุรี ','นพ.สุรชัย สุพันธมาตย์ ','โทร. 0-4526-0285 ','โทรสาร. 0-4524-3654 ','อุบลราชธานี\r'),(165,'รพ.แพทย์บัณฑิต ','นพ.นภดล ลุประสงค์ ','โทร. 0-5572-2044 ','โทรสาร. 0-5572-2044 ','กำแพงเพชร\r'),(166,'รพ.รวมแพทย์ นครสวรรค์ ','นพ.กิตติ ตั้งบรรเจิดสุข ','โทร. 0-5622-3600 ','โทรสาร. 0-5622-5912 ','นครสวรรค์\r'),(167,'รพ.ศรีสวรรค์ ','นพ.ชวลิต วิมลเฉลา ','โทร. 0-5631-1626 ','โทรสาร. 0-5622-2388 ','นครสวรรค์\r'),(168,'รพ.ปากน้ำโพ ','นพ.วิสิทธิ์ อวิรุทธ์นันท์ ','โทร. 0-5622-5501 ','โทรสาร. 0-5622-7179 ','นครสวรรค์\r'),(169,'รพ.ร่มฉัตร ','นพ.พรชัย สัตยาประเสริฐ ','โทร. 0-5631-2481-90 ','โทรสาร. 0-5622-8015 ','นครสวรรค์\r'),(170,'รพ.รัตนเวช นครสวรรค์ ','พญ.สุรางค์รัตน์ วรรธนภูติ ','โทร. 0-5622-0320-8 ','โทรสาร. 0-5621-2164 ','นครสวรรค์\r'),(171,'รพ.พัฒนเวชสุโขทัย ','นพ.สุชาติ กุละพัฒน์ ','โทร. 0-5562-1502-7 ','โทรสาร. 0-5561-2007 ','สุโขทัย\r'),(172,'รพ.รวมแพทย์สุโขทัย ','นพ.พจนารถ จันทโรจวงศ์ ','โทร. 0-5561-2189-90 ','โทรสาร. 0-5561-2221 ','สุโขทัย\r'),(173,'รพ.ตะพานหินรวมแพทย์ ','คุณบุญเลิศ คำนึงสิทธิ ','โทร. 0-5666-2678-80 ','โทรสาร. 0-5662-2208 ','พิจิตร\r'),(174,'รพ.สหเวชพิจิตร ','นพ.เสริมสุข เหลาหชัยอรุณ ','โทร. 0-5661-2791-3 ','โทรสาร. 0-5661-2794 ','พิจิตร\r'),(175,'รพ.พิษณุเวช ','นพ.สุเทพ นิ่มพิทักษ์พงศ์ ','โทร. 0-5524-4911-20 ','โทรสาร. 0-5525-2754 ','พิษณุโลก\r'),(176,'รพ.รวมแพทย์ พิษณุโลก ','นพ.พีระเชษฐ์ ภู่เกียรติ ','โทร. 0-5521-9307 ','โทรสาร. 0-5524-1934 ','พิษณุโลก\r'),(177,'รพ.รัตนเวช พิษณุโลก ','นพ.อุดม วาริทนันท์ ','โทร. 0-5521-0819-28 ','โทรสาร. 0-5521-1943 ','พิษณุโลก\r'),(178,'รพ.อินเตอร์เวชการ ','นพ.ยงยศ จริยวิทยาวัฒน์ ','โทร. 0-5521-8777 ','โทรสาร. 0-5524-5678 ','พิษณุโลก\r'),(179,'รพ.นครหล่ม ','นพ.พิเชษฐ์ อิศวสัมฤทธิ์ ','โทร. 0-5670-2015-7 ','โทรสาร. 0-5670-2018 ','เพชรบูรณ์\r'),(180,'รพ.เพชรรัตน์ ','ทพ.ประจวบ จันทรคิด ','โทร. 0-5672-0600-4 ','โทรสาร. 0-5672-0679 ','เพชรบูรณ์\r'),(181,'รพ.แพร่คริสเตียน ','นพ.สถาปน์ ชินวงศ์ ','โทร. 0-5451-1017 ','โทรสาร. 0-5452-2853 ','แพร่\r'),(182,'รพ.แพร่-ราม ','นพ.วรชัย วงศ์วรกุล ','โทร. 0-5452-2911-3 ','โทรสาร. 0-5453-0007 ','แพร่\r'),(183,'รพ.เกษมราษฎร์ศรีบุรินทร์ ','นพ.สมชัย ตั้งพร้อมพันธ์ ','โทร. 0-5371-7499 ','โทรสาร. 0-5371-7032 ','เชียงราย\r'),(184,'รพ.โอเวอร์บรุ๊ค ','นพ.วิฑูรย์ ยงเมธาวุฒิ ','โทร. 0-5371-5830-4 ','โทรสาร. 0-5371-6755 ','เชียงราย\r'),(185,'รพ.ช้างเผือก ','นพ.อำนวย ชิงชยานุรักษ์ ','โทร. 0-5322-0022 ','โทรสาร. 0-5321-8120 ','เชียงใหม่\r'),(186,'รพ.เชียงใหม่ใกล้หมอ ','นพ.ศยาม เวศกิจกุล ','โทร. 0-5320-0002 ','โทรสาร. 0-5320-0002 ','เชียงใหม่\r'),(187,'รพ.เชียงใหม่ราม ','นพ.วรพันธ์ อุณจักร ','โทร. 0-5322-4861 ','โทรสาร. 0-5322-4880 ','เชียงใหม่\r'),(188,'รพ.เซ็นทรัลเชียงใหม่ ','คุณวรัญญา เลี้ยงลักษณ์เลิศ ','โทร. 0-5381-9333 ','โทรสาร. 0-5327-1624 ','เชียงใหม่\r'),(189,'รพ.เทพปัญญา ','นพ.วรพันธ์ อุณจักร ','โทร. 0-5385-2590 ','โทรสาร. 0-5385-2590 ต่อ 3500 ','เชียงใหม่\r'),(190,'รพ.แมคคอร์มิค ','tนพ.อดุล วรินทรเวช ','โทร. 0-5392-1777 ','โทรสาร. 0-5392-1734 ','เชียงใหม่\r'),(191,'รพ.แมคเคน ','นพ.สมชาย อบบุญ ','โทร. 0-5381-7170 ','โทรสาร. 0-5312-4264 ','เชียงใหม่\r'),(192,'รพ.รวมแพทย์ เชียงใหม่ ','นพ.สุมิน พฤกษิกานนท์ ','โทร. 0-5327-0144-8 ','โทรสาร. 0-5327-9256 ','เชียงใหม่\r'),(193,'รพ.ราชเวชเชียงใหม่ ','ศ.นพ.ชาลี พรพัฒน์กุล ','โทร. 0-5380-1999 ','โทรสาร. 0-5380-1440 ','เชียงใหม่\r'),(194,'รพ.ลานนา ','นพ.ดุสิต ศรีสกุล ','โทร. 0-5399-9701 ','โทรสาร. 0-5399-9799 ','เชียงใหม่\r'),(195,'รพ.พะเยาราม ','นพ.ฐานิสร์ กาญจนรัตนากร ','โทร. 0-5441-1111-29 ','โทรสาร. 0-5441-1130 ','พะเยา\r'),(196,'รพ.เขลางค์ ','นพ.บุญจง ชูชัยแสงรัตน์ ','โทร. 0-5422-5100 ','โทรสาร. 0-5422-5105 ','ลำปาง\r'),(197,'รพ.หริภุญชัยเมโมเรียล ','นพ.วัชระ สนธิชัย ','โทร. 0-5358-1600-6 ','โทรสาร. 0-5358-1606 ','ลำพูน\r'),(198,'รพ.วิรัชศิลป์ ','นพ.ประสิทธิ์ วิรัชสุขสมบัติ ','โทร. 0-7750-3238 ','โทรสาร. 0-7750-1163 ','ชุมพร\r'),(199,'รพ.นครคริสเตียน ','นพ.ปรีชา มิตรกูล ','โทร. 0-7535-6214 ','โทรสาร. 0-7531-7110 ','นครศรีธรรมราช\r'),(200,'รพ.นครพัฒน์ ','นพ.พรชัย ลีานิพนธ์ ','โทร. 0-7530-5999 ','โทรสาร. 0-7530-5954 ','นครศรีธรรมราช\r'),(201,'รพ.นครินทร์ ','นพ.วิเชียร วิชานศวกุล ','โทร. 0-7531-2800-5 ','โทรสาร. 0-7531-7110 ','นครศรีธรรมราช\r'),(202,'รพ.รวมแพทย์ทุ่งสง ','พญ.กษมาพร เที่ยงธรรม ','โทร. 0-7541-1330 ','โทรสาร. 0-7542-0685 ','นครศรีธรรมราช\r'),(203,'รพ.กรุงเทพภูเก็ต ','นพ.ก้องเกียรติ เกษเพ็ชร ','โทร. 0-7625-4421-9 ','โทรสาร. 0-7625-4430 ','ภูเก็ต\r'),(204,'รพ.สิริโรจน์ ','นพ.อนุโรจน์ ธารสิริโรจน์ ','โทร. 0-7624-9400 ','โทรสาร. 0-7621-0936 ','ภูเก็ต\r'),(205,'รพ.ทักษิณ ','นพ.บรรจบ มานะกุล ','โทร. 0-7728-5701-5 ','โทรสาร. 0-7728-5701 ','สุราษฎร์ธานี\r'),(206,'รพ.ไทยอินเตอร์เนชั่นแนล ','คุณกริชพงศ์ เค้าอุทัย ','โทร. 0-7724-5721-6 ','โทรสาร. 0-7724-5690 ','สุราษฎร์ธานี\r'),(207,'รพ.บ้านดอนอินเตอร์ เกาะสมุย ','นพ.ชุมโชค จันทร์วิเมลือง ','โทร. 0-7724-5236 ','โทรสาร. 0-7748-5342 ','สุราษฎร์ธานี\r'),(208,'รพ.ตรังรวมแพทย์ ','นพ.สมชัย เจียรนัยศิลป์ ','โทร. 0-7521-8988 ','โทรสาร. 0-7521-4684 ','ตรัง\r'),(209,'รพ.วัฒนแพทย์ตรัง ','นพ.วิศิษฐ์ อมรวิทยารักษ์ ','โทร. 0-7520-5555 ','โทรสาร. 0-7520-5460 ','ตรัง\r'),(210,'รพ.รวมแพทย์พัทลุง ','พญ.ศศินี โภคโต ','โทร. 0-7461-3166 ','โทรสาร. 0-7462-7370 ','พัทลุง\r'),(211,'รพ.กรุงเทพหาดใหญ่ ','นพ.ณรงค์ฤทธิ์ ฮาวรังษี ','โทร. 0-7436-5780-9 ','โทรสาร. 0-7427-2840 ','สงขลา\r'),(212,'รพ.มูลนิธิมิตรภาพสามัคคี ','นพ.จำลอง บ่อเกิด ','โทร. 0-7424-6446 ','โทรสาร. 0-7424-3549 ','สงขลา\r'),(213,'รพ.ราษฎร์ยินดี ','คุณปิยพล ศรียะพันธุ์ ','โทร. 0-7420-0200 ','โทรสาร. 0-7420-0292 ','สงขลา\r'),(214,'รพ.ศิครินทร์หาดใหญ่ ','นพ.อาคเนย์ สุขอยู่ ','โทร. 0-7436-6966 ','โทรสาร. 0-7436-6955 ','สงขลา'),(215,'รพ. ทดสอบ','ศุภศักดิ์ กุลวงศ์อนันชัย','0865443352','029101428','กรุงเทพฯ');
/*!40000 ALTER TABLE `hospitals` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `invoice_orders`
--

DROP TABLE IF EXISTS `invoice_orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `invoice_orders` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `invoice_id` int(10) NOT NULL,
  `order_id` int(10) NOT NULL,
  `payment_term` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=112 DEFAULT CHARSET=utf8 COMMENT='invoice_id  <= transaction_id';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `invoice_orders`
--

LOCK TABLES `invoice_orders` WRITE;
/*!40000 ALTER TABLE `invoice_orders` DISABLE KEYS */;
INSERT INTO `invoice_orders` VALUES (100,92,130,NULL),(101,95,132,NULL),(102,95,135,NULL),(103,97,143,NULL),(104,99,144,NULL),(105,99,145,NULL),(106,99,146,NULL),(107,101,150,NULL),(108,102,147,NULL),(109,102,148,NULL),(110,102,151,NULL),(111,102,152,NULL);
/*!40000 ALTER TABLE `invoice_orders` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `manufacturing_items`
--

DROP TABLE IF EXISTS `manufacturing_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `manufacturing_items` (
  `id` int(11) NOT NULL,
  `request_id` int(11) DEFAULT NULL,
  `process_type` varchar(45) DEFAULT NULL,
  `output_unit` varchar(45) DEFAULT NULL,
  `output_count` varchar(45) DEFAULT NULL,
  `__label__` varchar(45) DEFAULT NULL,
  `transaction_items_transaction_id` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `manufacturing_item_request` (`request_id`),
  KEY `fk_manufacturing_items_transaction_items1` (`transaction_items_transaction_id`),
  CONSTRAINT `manufacturing_item_request` FOREIGN KEY (`request_id`) REFERENCES `manufacturing_requests` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `manufacturing_items`
--

LOCK TABLES `manufacturing_items` WRITE;
/*!40000 ALTER TABLE `manufacturing_items` DISABLE KEYS */;
/*!40000 ALTER TABLE `manufacturing_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `manufacturing_logs`
--

DROP TABLE IF EXISTS `manufacturing_logs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `manufacturing_logs` (
  `request_id` int(11) NOT NULL,
  `timestamp` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`request_id`),
  KEY `logs_manufacturing` (`request_id`),
  CONSTRAINT `logs_manufacturing` FOREIGN KEY (`request_id`) REFERENCES `manufacturing_requests` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `manufacturing_logs`
--

LOCK TABLES `manufacturing_logs` WRITE;
/*!40000 ALTER TABLE `manufacturing_logs` DISABLE KEYS */;
/*!40000 ALTER TABLE `manufacturing_logs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `manufacturing_requests`
--

DROP TABLE IF EXISTS `manufacturing_requests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `manufacturing_requests` (
  `id` int(11) NOT NULL,
  `transaction_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `transaction_manufacture` (`transaction_id`),
  CONSTRAINT `transaction_manufacture` FOREIGN KEY (`transaction_id`) REFERENCES `orders` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `manufacturing_requests`
--

LOCK TABLES `manufacturing_requests` WRITE;
/*!40000 ALTER TABLE `manufacturing_requests` DISABLE KEYS */;
/*!40000 ALTER TABLE `manufacturing_requests` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order_items`
--

DROP TABLE IF EXISTS `order_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `order_items` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `order_id` int(11) NOT NULL,
  `product_id` int(11) DEFAULT NULL,
  `order_per_day` varchar(45) DEFAULT NULL,
  `consume_time` varchar(45) DEFAULT NULL,
  `price` decimal(10,4) DEFAULT NULL,
  `quantity` decimal(10,6) DEFAULT NULL,
  `weight` decimal(10,6) DEFAULT NULL,
  `remarks` text,
  `unit_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_order_items_orders` (`order_id`),
  KEY `FK_order_items_products` (`product_id`),
  KEY `FK_order_items_product_unit` (`unit_id`)
) ENGINE=MyISAM AUTO_INCREMENT=2466 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_items`
--

LOCK TABLES `order_items` WRITE;
/*!40000 ALTER TABLE `order_items` DISABLE KEYS */;
INSERT INTO `order_items` VALUES (2465,153,1,'100','[\"morning_and_evening\"]',4.0000,NULL,NULL,NULL,NULL);
/*!40000 ALTER TABLE `order_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order_logs`
--

DROP TABLE IF EXISTS `order_logs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `order_logs` (
  `order_id` int(11) NOT NULL,
  `updated` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `category` varchar(45) DEFAULT NULL,
  `msg` varchar(200) NOT NULL,
  KEY `logs_transaction` (`order_id`),
  KEY `time` (`updated`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_logs`
--

LOCK TABLES `order_logs` WRITE;
/*!40000 ALTER TABLE `order_logs` DISABLE KEYS */;
INSERT INTO `order_logs` VALUES (153,'2011-11-14 11:30:06','UPDATED','saved by 1'),(153,'2011-11-14 11:30:06','UPDATED','saved by 1'),(153,'2011-11-14 11:30:06','UPDATED','saved by 1'),(153,'2011-11-14 11:30:06','UPDATED','saved by 1'),(153,'2011-11-14 11:30:13','UPDATED','saved by 1'),(153,'2011-11-14 11:30:13','UPDATED','saved by 1'),(153,'2011-11-14 11:30:17','UPDATED','saved by 1'),(153,'2011-11-14 11:30:17','UPDATED','saved by 1'),(153,'2011-11-14 11:30:31','UPDATED','saved by 1'),(153,'2011-11-14 11:30:31','UPDATED','saved by 1'),(153,'2011-11-14 11:30:36','UPDATED','saved by 1'),(153,'2011-11-14 11:30:36','UPDATED','saved by 1'),(153,'2011-11-14 11:30:54','UPDATED','saved by 1'),(153,'2011-11-14 11:30:54','UPDATED','saved by 1'),(153,'2011-11-14 11:30:54','UPDATED','saved by 1'),(153,'2011-11-14 11:30:54','UPDATED','saved by 1'),(153,'2011-11-14 11:30:54','UPDATED','saved by 1'),(153,'2011-11-14 11:30:54','UPDATED','saved by 1'),(153,'2011-11-14 11:30:54','UPDATED','saved by 1'),(153,'2011-11-14 11:30:54','UPDATED','saved by 1'),(153,'2011-11-14 11:30:54','UPDATED','saved by 1'),(153,'2011-11-14 11:31:09','UPDATED','saved by 1'),(153,'2011-11-14 11:31:09','UPDATED','saved by 1'),(153,'2011-11-14 15:23:41','UPDATED','saved by 1'),(153,'2011-11-14 15:23:41','UPDATED','saved by 1');
/*!40000 ALTER TABLE `order_logs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order_processing`
--

DROP TABLE IF EXISTS `order_processing`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `order_processing` (
  `id` int(10) DEFAULT NULL,
  `order_id` int(10) DEFAULT NULL,
  `station_id` int(10) DEFAULT NULL,
  `updated` int(10) DEFAULT NULL,
  `operator` int(10) DEFAULT NULL,
  `remarks` varchar(500) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_processing`
--

LOCK TABLES `order_processing` WRITE;
/*!40000 ALTER TABLE `order_processing` DISABLE KEYS */;
/*!40000 ALTER TABLE `order_processing` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order_station`
--

DROP TABLE IF EXISTS `order_station`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `order_station` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `order_id` int(10) DEFAULT NULL,
  `station_id` int(10) DEFAULT NULL,
  `remarks` varchar(500) DEFAULT NULL,
  `operator_id` int(10) DEFAULT NULL,
  `updated` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=225 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_station`
--

LOCK TABLES `order_station` WRITE;
/*!40000 ALTER TABLE `order_station` DISABLE KEYS */;
INSERT INTO `order_station` VALUES (27,NULL,NULL,'Remarks...',NULL,'2011-09-16 15:40:34'),(28,NULL,NULL,'Remarks...',NULL,'2011-09-16 15:41:08'),(29,NULL,NULL,'Remarks...',NULL,'2011-09-16 15:43:02'),(30,NULL,NULL,'Remarks...',NULL,'2011-09-16 15:43:02'),(31,NULL,NULL,'234234',NULL,'2011-09-16 15:44:34'),(32,NULL,NULL,'test',NULL,'2011-09-16 15:44:34'),(33,NULL,NULL,'test',NULL,'2011-09-16 15:44:34'),(34,NULL,NULL,'Remarks...',NULL,'2011-09-16 15:47:18'),(35,NULL,NULL,'Remarks...',NULL,'2011-09-16 15:47:18'),(36,98,109,'Remarks...',1,'2011-09-16 15:51:21'),(37,98,110,'Remarks...',1,'2011-09-16 15:51:21'),(38,98,104,'Remarks...',1,'2011-09-16 15:53:33'),(39,98,106,'Remarks...',1,'2011-09-16 15:53:33'),(40,98,107,'Remarks...',1,'2011-09-16 15:53:33'),(41,98,100,'Remarks...',1,'2011-09-16 15:58:15'),(42,98,101,'Remarks...',1,'2011-09-16 15:58:15'),(43,98,102,'Remarks...',1,'2011-09-16 15:58:15'),(44,98,103,'Remarks...',1,'2011-09-16 15:58:15'),(45,98,104,'Remarks...',1,'2011-09-16 15:58:15'),(46,98,105,'Remarks...',1,'2011-09-16 15:58:15'),(47,98,106,'Remarks...',1,'2011-09-16 15:58:15'),(48,98,107,'Remarks...',1,'2011-09-16 15:58:15'),(49,98,108,'Remarks...',1,'2011-09-16 15:58:15'),(50,98,109,'Remarks...',1,'2011-09-16 15:58:15'),(51,98,107,'Remarks...',1,'2011-09-16 15:59:35'),(52,98,108,'Remarks...',1,'2011-09-16 15:59:35'),(53,98,109,'Remarks...',1,'2011-09-16 15:59:35'),(54,98,110,'done!',1,'2011-09-16 15:59:47'),(55,97,100,'Remarks...',1,'2011-09-16 16:08:12'),(56,97,101,'Remarks...',1,'2011-09-16 16:08:12'),(57,97,102,'Remarks...',1,'2011-09-16 16:08:12'),(58,97,107,'Remarks...',1,'2011-09-16 16:08:36'),(59,97,108,'Remarks...',1,'2011-09-16 16:08:36'),(60,97,109,'Remarks...',1,'2011-09-16 16:08:36'),(61,97,110,'Remarks...',1,'2011-09-16 16:08:53'),(62,91,104,'Remarks...',1,'2011-09-16 16:13:46'),(63,91,104,'Remarks...',1,'2011-09-16 16:14:17'),(64,91,104,'Remarks...',1,'2011-09-16 16:15:23'),(65,98,104,'Remarks...',1,'2011-09-16 16:16:12'),(66,98,105,'Remarks...',1,'2011-09-16 16:16:12'),(67,98,105,'Remarks...',1,'2011-09-16 16:16:29'),(68,98,106,'Remarks...',1,'2011-09-16 16:16:29'),(69,98,107,'Remarks...',1,'2011-09-16 16:16:29'),(70,98,102,'Remarks...',1,'2011-09-16 16:16:52'),(71,98,103,'Remarks...',1,'2011-09-16 16:16:52'),(72,98,105,'Remarks...',1,'2011-09-16 16:17:31'),(73,98,105,'Remarks...',1,'2011-09-16 16:17:54'),(74,98,106,'Remarks...',1,'2011-09-16 16:17:54'),(75,92,106,'Remarks...',1,'2011-09-16 16:20:40'),(76,92,102,'Remarks...',1,'2011-09-16 16:22:21'),(77,92,103,'Remarks...',1,'2011-09-16 16:22:21'),(78,100,100,'Remarks...',1,'2011-09-18 22:12:31'),(79,100,101,'Remarks...',1,'2011-09-18 22:12:31'),(80,100,102,'Remarks...',1,'2011-09-18 22:12:31'),(81,99,100,'Remarks...',1,'2011-09-19 20:08:12'),(82,99,101,'Remarks...',1,'2011-09-19 20:08:13'),(83,99,102,'Remarks...',1,'2011-09-19 20:08:13'),(84,92,100,'Remarks...',1,'2011-09-19 20:08:35'),(85,92,101,'Remarks...',1,'2011-09-19 20:08:35'),(86,92,102,'Remarks...',1,'2011-09-19 20:08:35'),(87,92,103,'Remarks...',1,'2011-09-19 20:08:35'),(88,92,107,'Remarks...',1,'2011-09-19 20:08:57'),(89,92,108,'Remarks...',1,'2011-09-19 20:08:57'),(90,100,103,'Remarks...',1,'2011-09-19 20:16:45'),(91,100,104,'Remarks...',1,'2011-09-19 20:16:45'),(92,100,105,'Remarks...',1,'2011-09-19 20:16:45'),(93,106,101,'Remarks...',1,'2011-09-22 11:40:18'),(94,106,102,'Remarks...',1,'2011-09-22 11:40:18'),(95,106,103,'Remarks...',1,'2011-09-22 11:40:18'),(96,106,104,'Remarks...',1,'2011-09-22 11:42:04'),(97,106,105,'Remarks...',1,'2011-09-22 11:43:09'),(98,106,106,'Remarks...',1,'2011-09-22 11:43:09'),(99,106,107,'Remarks...',1,'2011-09-22 11:43:09'),(100,106,108,'Remarks...',1,'2011-09-22 11:43:09'),(101,106,109,'Remarks...',1,'2011-09-22 11:43:09'),(102,106,110,'Remarks...',1,'2011-09-22 11:43:09'),(103,107,100,'Remarks...',1,'2011-09-22 15:34:16'),(104,107,101,'Remarks...',1,'2011-09-22 15:34:16'),(105,107,102,'Remarks...',1,'2011-09-22 15:34:16'),(106,107,103,'Remarks...',1,'2011-09-22 15:34:16'),(107,107,104,'Remarks...',1,'2011-09-22 15:34:58'),(108,107,105,'Remarks...',1,'2011-09-22 15:34:59'),(109,107,106,'Remarks...',1,'2011-09-22 15:35:37'),(110,107,107,'Remarks...',1,'2011-09-22 15:35:37'),(111,107,108,'Remarks...',1,'2011-09-22 15:35:37'),(112,107,109,'Remarks...',1,'2011-09-22 15:35:37'),(113,107,110,'Remarks...',1,'2011-09-22 15:35:37'),(114,128,101,'Remarks...',1,'2011-10-15 01:29:38'),(115,128,102,'Remarks...',1,'2011-10-15 01:29:38'),(116,128,103,'Remarks...',1,'2011-10-15 01:29:38'),(117,128,105,'Remarks...',1,'2011-10-15 01:29:38'),(118,128,106,'Remarks...',1,'2011-10-15 01:29:38'),(119,128,107,'Remarks...',1,'2011-10-15 01:29:38'),(120,128,108,'Remarks...',1,'2011-10-15 01:29:38'),(121,128,109,'Remarks...',1,'2011-10-15 01:29:38'),(122,128,110,'Remarks...',1,'2011-10-15 01:29:38'),(123,127,101,'test',1,'2011-10-15 01:35:17'),(124,127,102,'test',1,'2011-10-15 01:35:17'),(125,127,103,'te',12,'2011-10-15 01:41:52'),(126,127,104,'te',12,'2011-10-15 01:41:52'),(127,127,105,'te',12,'2011-10-15 01:41:52'),(128,127,106,'te3',12,'2011-10-15 01:41:52'),(129,127,104,'yyyyy',1,'2011-10-15 01:47:30'),(130,127,104,'888',1,'2011-10-15 01:47:57'),(131,127,105,'888',1,'2011-10-15 01:47:57'),(132,127,107,'tw',1,'2011-10-15 01:48:43'),(133,127,108,'wwe',1,'2011-10-15 01:48:43'),(134,127,109,'7879',12,'2011-10-15 01:49:07'),(135,127,110,'789789',12,'2011-10-15 01:49:07'),(136,135,102,'a',1,'2011-10-17 00:07:27'),(137,135,103,'b',1,'2011-10-17 00:07:27'),(138,135,104,'c',1,'2011-10-17 00:07:27'),(139,135,101,'1',1,'2011-10-17 00:08:06'),(140,135,105,'2',1,'2011-10-17 00:08:06'),(141,135,106,'3',1,'2011-10-17 00:08:06'),(142,135,107,'4',1,'2011-10-17 00:08:06'),(143,135,108,'5',1,'2011-10-17 00:08:06'),(144,135,109,'7',1,'2011-10-17 00:08:06'),(145,135,110,'8',1,'2011-10-17 00:08:06'),(146,135,101,'a',1,'2011-10-18 08:42:27'),(147,135,102,'a',1,'2011-10-18 08:42:28'),(148,135,103,'a',1,'2011-10-18 08:42:28'),(149,135,101,'test',1,'2011-10-18 08:44:47'),(150,135,102,'test',1,'2011-10-18 08:44:48'),(151,135,103,'etet',1,'2011-10-18 08:44:48'),(152,135,101,'-',1,'2011-10-18 08:45:03'),(153,135,102,'-',1,'2011-10-18 08:45:03'),(154,135,103,'-',1,'2011-10-18 08:45:03'),(155,135,104,'-',1,'2011-10-18 08:45:03'),(156,144,101,'-',1,'2011-11-05 16:57:53'),(157,144,102,'-',1,'2011-11-05 16:57:53'),(158,144,103,'-',1,'2011-11-05 16:57:53'),(159,144,104,'-',1,'2011-11-05 16:57:53'),(160,144,105,'-',1,'2011-11-05 16:57:53'),(161,144,106,'-',1,'2011-11-05 16:57:53'),(162,144,107,'-',1,'2011-11-05 16:57:53'),(163,144,108,'-',1,'2011-11-05 16:57:53'),(164,144,109,'-',1,'2011-11-05 16:57:53'),(165,144,110,'-',1,'2011-11-05 16:57:53'),(166,145,101,'-',1,'2011-11-05 16:59:02'),(167,145,102,'-',1,'2011-11-05 16:59:02'),(168,145,103,'-',1,'2011-11-05 16:59:02'),(169,145,104,'-',1,'2011-11-05 16:59:02'),(170,145,105,'-',1,'2011-11-05 16:59:02'),(171,145,106,'-',1,'2011-11-05 16:59:02'),(172,145,107,'-',1,'2011-11-05 16:59:02'),(173,145,108,'-',1,'2011-11-05 16:59:02'),(174,145,109,'-',1,'2011-11-05 16:59:02'),(175,145,110,'-',1,'2011-11-05 16:59:02'),(176,148,101,'-',1,'2011-11-13 14:58:13'),(177,148,102,'-',1,'2011-11-13 14:58:13'),(178,148,103,'-',1,'2011-11-13 14:58:13'),(179,148,104,'-',1,'2011-11-13 14:58:13'),(180,148,105,'-',1,'2011-11-13 14:58:13'),(181,150,101,'-',1,'2011-11-14 17:11:00'),(182,150,102,'-',1,'2011-11-14 17:11:00'),(183,150,103,'-',1,'2011-11-14 17:11:25'),(184,150,104,'-',1,'2011-11-14 17:11:25'),(185,150,105,'-',1,'2011-11-14 17:12:09'),(186,150,106,'-',1,'2011-11-14 17:12:09'),(187,150,107,'-',1,'2011-11-14 17:12:09'),(188,150,108,'-',1,'2011-11-14 17:12:09'),(189,150,109,'-',1,'2011-11-14 17:12:09'),(190,150,108,'-',1,'2011-11-14 17:35:41'),(191,150,109,'-',1,'2011-11-14 17:35:41'),(192,150,110,'-',1,'2011-11-14 17:42:24'),(193,150,110,'-',1,'2011-11-14 17:50:02'),(194,151,101,'-',1,'2011-11-14 17:52:23'),(195,151,102,'-',1,'2011-11-14 17:52:23'),(196,151,103,'-',1,'2011-11-14 17:52:23'),(197,151,104,'-',1,'2011-11-14 17:52:49'),(198,151,105,'-',1,'2011-11-14 17:52:49'),(199,151,106,'-',1,'2011-11-14 17:52:49'),(200,151,107,'-',1,'2011-11-14 17:52:49'),(201,151,108,'-',1,'2011-11-14 17:52:49'),(202,151,109,'-',1,'2011-11-14 17:52:49'),(203,151,110,'-',1,'2011-11-14 17:53:04'),(204,151,110,'-',1,'2011-11-14 18:01:52'),(205,152,101,'-',1,'2011-11-14 18:15:39'),(206,152,102,'-',1,'2011-11-14 18:15:39'),(207,152,103,'-',1,'2011-11-14 18:16:12'),(208,152,104,'-',1,'2011-11-14 18:16:12'),(209,152,105,'-',1,'2011-11-14 18:16:12'),(210,152,106,'-',1,'2011-11-14 18:16:12'),(211,152,107,'-',1,'2011-11-14 18:16:12'),(212,152,108,'-',1,'2011-11-14 18:16:12'),(213,152,109,'-',1,'2011-11-14 18:16:12'),(214,152,110,'-',1,'2011-11-14 18:16:35'),(215,153,101,'-',1,'2011-11-14 18:30:54'),(216,153,102,'-',1,'2011-11-14 18:30:54'),(217,153,103,'-',1,'2011-11-14 18:30:54'),(218,153,104,'-',1,'2011-11-14 18:30:54'),(219,153,105,'-',1,'2011-11-14 18:30:54'),(220,153,106,'-',1,'2011-11-14 18:30:54'),(221,153,107,'-',1,'2011-11-14 18:30:54'),(222,153,108,'-',1,'2011-11-14 18:30:54'),(223,153,109,'-',1,'2011-11-14 18:30:54'),(224,153,110,'-',1,'2011-11-14 18:31:09');
/*!40000 ALTER TABLE `order_station` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `orders`
--

DROP TABLE IF EXISTS `orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `orders` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uuid` varchar(45) NOT NULL DEFAULT 'xxxx-xxx-xxxxxx',
  `status_id` int(10) NOT NULL,
  `request_received` timestamp NULL DEFAULT NULL,
  `quote_price` decimal(10,2) DEFAULT NULL,
  `delivery_date` date DEFAULT NULL,
  `customer_id` int(11) NOT NULL,
  `patient_id` int(11) NOT NULL,
  `days` int(10) NOT NULL DEFAULT '0',
  `amount` double DEFAULT NULL,
  `amount_total` double DEFAULT NULL,
  `additional_charge` double DEFAULT NULL,
  `discount_factor` decimal(5,2) DEFAULT NULL,
  `marketing_charge` varchar(200) DEFAULT NULL,
  `monthly_price` decimal(20,4) DEFAULT NULL,
  `daily_price` decimal(20,4) DEFAULT NULL,
  `total_weight` double DEFAULT NULL,
  `data` text,
  `invoice_id` int(10) DEFAULT NULL,
  `station_id` int(10) DEFAULT NULL,
  `remarks` varchar(500) DEFAULT NULL,
  `lot_number` int(10) DEFAULT '0',
  `clinician_id` int(10) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `transaction_patient` (`patient_id`),
  KEY `transaction_customer` (`customer_id`)
) ENGINE=MyISAM AUTO_INCREMENT=154 DEFAULT CHARSET=utf8 COMMENT='(request, quotation)';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orders`
--

LOCK TABLES `orders` WRITE;
/*!40000 ALTER TABLE `orders` DISABLE KEYS */;
INSERT INTO `orders` VALUES (153,'1111-004-000153',2,'2011-11-14 11:30:06',NULL,'0000-00-00',4,61,30,1200,1284,NULL,0.00,'',1284.0000,42.8000,NULL,NULL,NULL,110,'',1,3);
/*!40000 ALTER TABLE `orders` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `patients`
--

DROP TABLE IF EXISTS `patients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `patients` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(45) DEFAULT NULL,
  `hn` varchar(20) NOT NULL DEFAULT '0',
  `customer_id` int(10) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=62 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `patients`
--

LOCK TABLES `patients` WRITE;
/*!40000 ALTER TABLE `patients` DISABLE KEYS */;
INSERT INTO `patients` VALUES (61,'บอล','0001',4);
/*!40000 ALTER TABLE `patients` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_inventory`
--

DROP TABLE IF EXISTS `product_inventory`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `product_inventory` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `product_id` int(10) NOT NULL,
  `in` decimal(16,6) NOT NULL,
  `out` decimal(16,6) NOT NULL,
  `count` decimal(16,6) NOT NULL,
  `updated` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `remarks` text NOT NULL,
  `operator_id` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=102 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_inventory`
--

LOCK TABLES `product_inventory` WRITE;
/*!40000 ALTER TABLE `product_inventory` DISABLE KEYS */;
INSERT INTO `product_inventory` VALUES (100,1,0.000000,3.000000,94.000000,'2011-11-14 11:31:09','Used by Order ID: 1111-004-000153',1),(101,1,0.000000,-94.000000,0.000000,'2011-11-14 11:31:39','',1);
/*!40000 ALTER TABLE `product_inventory` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_unit`
--

DROP TABLE IF EXISTS `product_unit`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `product_unit` (
  `id` int(11) NOT NULL DEFAULT '0',
  `display_rank` int(10) DEFAULT NULL,
  `display_name` varchar(100) DEFAULT NULL,
  `gram_conversion_factor` decimal(20,6) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_unit`
--

LOCK TABLES `product_unit` WRITE;
/*!40000 ALTER TABLE `product_unit` DISABLE KEYS */;
INSERT INTO `product_unit` VALUES (1,1,'mg',1000.000000),(2,2,'g',1.000000),(3,3,'nano gram',1000000.000000),(4,4,'capsule',NULL),(5,5,'AU',NULL),(6,6,'softgel',NULL),(7,7,'box',NULL);
/*!40000 ALTER TABLE `product_unit` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `products`
--

DROP TABLE IF EXISTS `products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `products` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `code` varchar(10) NOT NULL DEFAULT '0',
  `display_name` varchar(500) DEFAULT NULL,
  `category_id` bigint(11) NOT NULL,
  `unit_id` int(10) NOT NULL,
  `default_consume_time` varchar(100) DEFAULT NULL,
  `note` text,
  `recommended_dosage` varchar(200) DEFAULT NULL,
  `inactive` tinyint(1) NOT NULL DEFAULT '0',
  `price_base` double DEFAULT NULL,
  `price_formula` varchar(1000) DEFAULT NULL,
  `price_var` double DEFAULT NULL,
  `volume_base` double DEFAULT NULL,
  `volume_formula` varchar(1000) DEFAULT NULL,
  `volume_var` double DEFAULT NULL,
  `stock_balance` decimal(20,8) DEFAULT NULL,
  `description` varchar(1000) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_products_categories` (`category_id`),
  KEY `FK_products_product_unit` (`unit_id`)
) ENGINE=MyISAM AUTO_INCREMENT=127 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `products`
--

LOCK TABLES `products` WRITE;
/*!40000 ALTER TABLE `products` DISABLE KEYS */;
INSERT INTO `products` VALUES (1,'0','L-Arginine             ',1,1,'[\"morning_and_evening\"]','','100',0,0.0015,'return ceil($QUANTITY/500)*4;',NULL,0.52666,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(2,'0','L-Carnitine',1,1,'[\"morning_and_evening\"]','','100',0,0.006,'$v = $QUANTITY;\r\nif($v<=500){\r\n$v = 11;\r\n}\r\nelse{\r\n$v = ceil($v/250)*5;\r\n}\r\nreturn $v;\r\n\r\n',NULL,0.54566,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(3,'0','L-Carnosine',1,1,'[\"morning_and_evening\"]','','100-1,000',0,0.0358,'return ceil($QUANTITY/100)*5;',NULL,0.5717,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(4,'0','L-Cystine',1,1,'[\"morning_and_evening\"]','','100',0,0.006,'return ceil($QUANTITY/200)*5;',NULL,0.492,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(5,'0','L-Glutamic Acid',1,1,'[\"morning_and_evening\"]','','100',0,0.0005,'return ceil($QUANTITY/1000)*3;',NULL,0.6403,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(6,'0','L-Glutamine',1,1,'[\"morning_and_evening\"]','','100',0,0.0015,'return ceil($QUANTITY/500)*4;',NULL,0.5533,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(7,'0','L-Lysine Monohydrochloride',1,1,'[\"morning_and_evening\"]','','100-250',0,0.0005,'return ceil($QUANTITY/400)*4;',NULL,0.5293,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(8,'0','L-Methionine',1,1,'[\"morning_and_evening\"]','','100',0,0.0025,'return ceil($QUANTITY/300)*4;',NULL,0.576,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(9,'0','L-Ornithine',1,1,'[\"morning_and_evening\"]','','100',0,0.0025,'$v = $QUANTITY;\r\nif($v<=100){\r\n$v = 4;\r\n}\r\nelse{\r\n$v = 4+ceil(($v-100)/100);\r\n}\r\nreturn $v;',NULL,0.5373,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(10,'0','L-Phenylalanine',1,1,'[\"morning_and_evening\"]','','100',0,0.003,'$v = $QUANTITY;\r\nif($v<=200){\r\n$v = 4;\r\n}\r\nelse{\r\n$v = 4+ceil(($v-200)/200)*2;\r\n}\r\nreturn $v;',NULL,0.5883,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(11,'0','L-Tryptophan ; mg                                     ',1,1,'[\"morning_and_evening\"]',NULL,'100-1,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(12,'0','L-Tyrosine ; mg                                     ',1,1,'[\"morning_and_evening\"]',NULL,'100',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(13,'0','Taurine ; mg                                           ',1,1,'[\"morning_and_evening\"]',NULL,'100',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(14,'0','Alpha Lipoic Acid',2,1,'[\"morning_and_evening\"]','','100',0,0.0045,'$v = $QUANTITY;\r\nif($v<=200){\r\n$v = 8;\r\n}\r\nelse if($v<=800){\r\n$v = (ceil($v/200)*4)+4;\r\n}\r\nelse{\r\n$v = 20+ceil(($v-800)/200)*2;\r\n}\r\nreturn $v;',NULL,0.52,'$VOLUME * $QUANTITY;',NULL,100.00000000,''),(15,'0','Astaxanthin',2,1,'[\"morning_and_evening\"]','','2-6',0,0.1,'return ceil($QUANTITY/1.5)*1;',NULL,0.4367,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(16,'0','Coenzyme Q10',2,1,'[\"morning_and_evening\"]','','30',0,0.025,'return ceil($QUANTITY/50)*7.5;',NULL,0.2957,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(17,'0','Grape Seed Extract',2,1,'[\"morning_and_evening\"]','','300',0,0.012,'return ceil($QUANTITY/100)*4;',NULL,0.4397,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(18,'0','Green Tea Extract Decaff',2,1,'[\"morning_and_evening\"]','','100-1,500',0,0.004,'return ceil($QUANTITY/100)*4;',NULL,0.5203,'$VOLUME * $QUANTITY;',NULL,400.00000000,''),(19,'0','L-Glutathione',2,1,'[\"morning_and_evening\"]','','50',0,0.014,'return ceil($QUANTITY/200)*4;',NULL,0.4567,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(20,'0','Lycopene, Tomato Extract',2,1,'[\"morning_and_evening\"]','','20',0,0.0045,'return ceil($QUANTITY/100)*3;',NULL,0.4863,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(21,'0','Milk Thistle Silymarin',2,1,'[\"morning_and_evening\"]','','160-800',0,0.009,'return ceil($QUANTITY/200)*5.5;',NULL,0.549,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(22,'0','N-Acetyl-L-Cysteine',2,1,'[\"morning_and_evening\"]','','100',0,0.0055,'$v = $QUANTITY;\r\nif($v<=500){\r\n$v = 14;\r\n}\r\nelse if($v<=750){\r\n$v = 20;\r\n}\r\nelse if($v<=1000){\r\n$v = 25;\r\n}\r\nelse if($v<=2000){\r\n$v = 34;\r\n}\r\nelse{\r\n$v = 34+ceil(($v-2000)/1000)*8;\r\n}\r\nreturn $v;',NULL,0.5387,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(23,'0','Pomegranate',2,1,'[\"morning_and_evening\"]','','500',0,1,'$PRICE * $QUANTITY;',NULL,0.5347,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(24,'0','Pycnogynol, Pine Extract ; mg',2,1,'[\"morning_and_evening\"]',NULL,'50-360',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(25,'0','Resveratrol ; mg',2,1,'[\"morning_and_evening\"]',NULL,'250',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(26,'0','Chondroitin SCP',3,1,'[\"morning_and_evening\"]','','800',0,0.0065,'return ceil($QUANTITY/400)*10;',NULL,0.4163,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(27,'0','Glucosamine Hydrochoride',3,1,'[\"morning_and_evening\"]','','500-1,000',0,0.003,'return ceil($QUANTITY/1000)*12;',NULL,0.738,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(28,'0','Citicoline',4,1,'[\"morning_and_evening\"]','','100',0,0.02,'return ceil($QUANTITY/20)*2.5;',NULL,0.5163,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(29,'0','Ginkgo Biloba Phytosome',4,1,'[\"morning_and_evening\"]','','100-1,000',0,0.014,'return ceil($QUANTITY/100)*5;',NULL,0.5273,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(30,'0','Ginkgo Serine',4,1,'[\"morning_and_evening\"]','','100',0,0.014,'return ceil($QUANTITY/100)*5;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(31,'0','Lecithin',4,1,'[\"morning_and_evening\"]','','500',0,0.0025,'return ceil($QUANTITY/500)*6;',NULL,0.361,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(32,'0','Digestzyme',5,1,'[\"morning_and_evening\"]','','250-500',0,0.0039,'return ceil($QUANTITY/250)*4;',NULL,0.485,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(33,'0','Fiber FOS',5,1,'[\"morning_and_evening\"]','','3,000',0,0.0005,'return ceil($QUANTITY/1000)*3;',NULL,0.5883,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(34,'0','Fiber Psyllium Husk',5,1,'[\"morning_and_evening\"]','','1,000',0,0.0005,'return ceil($QUANTITY/1000)*3;',NULL,0.585,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(35,'0','Lactobacillus Acidophilus',5,1,'[\"morning_and_evening\"]','','150',0,0.0039,'return ceil($QUANTITY/150)*2;',NULL,0.448,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(36,'0','Ashwagandha Extract',6,1,'[\"morning_and_evening\"]','','450',0,0.008,'return ceil($QUANTITY/450)*10;',NULL,0.6613,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(37,'0','Bacopin, Bacopa Monniera',6,1,'[\"morning_and_evening\"]','','50-300',0,0.004,'$PRICE * $QUANTITY;',NULL,0.506,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(38,'0','Beta Glucan',6,1,'[\"morning_and_evening\"]','','40-500',0,0.012,'$PRICE * $QUANTITY;',NULL,0.4757,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(39,'0','Butea, Red Kwao Krua',6,1,'[\"morning_and_evening\"]','','300-1,000',0,0.008,'$PRICE * $QUANTITY;',NULL,0.4447,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(40,'0','Bilberry',6,1,'[\"morning_and_evening\"]','','80-200',0,0.03,'$PRICE * $QUANTITY;',NULL,0.663,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(41,'0','BioPerine, Black Pepper',6,1,'[\"morning_and_evening\"]','','5-100',0,0.001,'$PRICE * $QUANTITY;',NULL,0.5407,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(42,'0','Black Cohosh',6,1,'[\"morning_and_evening\"]','','80',0,0.0055,'$PRICE * $QUANTITY;',NULL,0.6463,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(43,'0','Centellin, Gotu Kola',6,1,'[\"morning_and_evening\"]','','60-350',0,0.003,'$PRICE * $QUANTITY;',NULL,0.5067,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(44,'0','Chlorophyll',6,1,'[\"morning_and_evening\"]','','100',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(45,'0','Citrus Bioflavonoids',6,1,'[\"morning_and_evening\"]','','300-1,000',0,0.002,'$PRICE * $QUANTITY;',NULL,0.4883,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(46,'0','Curbilene, Pumpkin Seed ; mg',6,1,'[\"morning_and_evening\"]',NULL,'100',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(47,'0','Curcumin C3 ; mg',6,1,'[\"morning_and_evening\"]',NULL,'100-3,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(48,'0','Emblic Extract ; mg',6,1,'[\"morning_and_evening\"]',NULL,'100-1,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(49,'0','Gamma Oryzanol, Rice Extract ; mg',6,1,'[\"morning_and_evening\"]',NULL,'600',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(50,'0','Garlic ; mg',6,1,'[\"morning_and_evening\"]',NULL,'600',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(51,'0','Ginseng ; mg',6,1,'[\"morning_and_evening\"]',NULL,'200',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(52,'0','Hawthron Extract ; mg',6,1,'[\"morning_and_evening\"]',NULL,'100-1,200',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(53,'0','Horsetail ; mg',6,1,'[\"morning_and_evening\"]',NULL,'300-6,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(54,'0','Indole-3-Carbinol ; mg',6,1,'[\"morning_and_evening\"]',NULL,'300',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(55,'0','Licorice ; mg',6,1,'[\"morning_and_evening\"]',NULL,'500-4,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(56,'0','Madeglucyl ; mg',6,1,'[\"morning_and_evening\"]',NULL,'500-1,500',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(57,'0','Oleaselect, Olive Pulp Extract ; mg',6,1,'[\"morning_and_evening\"]',NULL,'25-100',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(58,'0','Phytosterol ; mg',6,1,'[\"morning_and_evening\"]',NULL,'800',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(59,'0','Policosanol, Saccharum Officinarum ; mg',6,1,'[\"morning_and_evening\"]',NULL,'5-50',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(60,'0','Rosemary ; mg',6,1,'[\"morning_and_evening\"]',NULL,'5-3,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(61,'0','Safflower Extract ; mg',6,1,'[\"morning_and_evening\"]',NULL,'100-1,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(62,'0','Saw Palmetto Serenoa ; mg ',6,1,'[\"morning_and_evening\"]',NULL,'320',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(63,'0','Soy Isoflavone ; mg',6,1,'[\"morning_and_evening\"]',NULL,'100-1,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(64,'0','Soy Peptide ; mg',6,1,'[\"morning_and_evening\"]',NULL,'200',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(65,'0','Silyphos ; mg',6,1,'[\"morning_and_evening\"]',NULL,'180-600',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(66,'0','Triphala, Terminalia Extract ; mg',6,1,'[\"morning_and_evening\"]',NULL,'150-500',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(67,'0','Valerian Extract ; mg',6,1,'[\"morning_and_evening\"]',NULL,'400-900',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(68,'0','Activator Formula',7,1,'[\"morning_and_evening\"]','','510',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(69,'0','Adrenal Support Formula',7,1,'[\"morning_and_evening\"]','','15',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(70,'0','Adrenal Support Advance Formula',7,1,'[\"morning_and_evening\"]','','25',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(71,'0','Pregnenolone',7,1,'[\"morning_and_evening\"]','','100',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(72,'0','Relax Formula',7,1,'[\"morning_and_evening\"]','','100',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(73,'0','Sleep Junior Formula',7,1,'[\"morning_and_evening\"]','','1',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(74,'0','Sleep Advance Formula',7,1,'[\"morning_and_evening\"]','','3',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(75,'0','Slim Advance Formula',7,1,'[\"morning_and_evening\"]','','100',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(76,'0','Ashitaba, Japanese Angelica',8,1,'[\"morning_and_evening\"]','','100-3,000',0,0.002,'$PRICE * $QUANTITY;',NULL,0.536,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(77,'0','Echinacea Extract',8,1,'[\"morning_and_evening\"]','','100-1,000',0,0.018,'$v = $QUANTITY;\r\nif($v<=400){\r\n$v = ceil($v/100)*4;\r\n}\r\nelse{\r\n$v = 15+ceil(($v-400)/100)*2.5;\r\n}\r\nreturn $v;',NULL,0.7307,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(78,'0','AHCC Mushroom Mycelia Extract',8,1,'[\"morning_and_evening\"]','','750',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(79,'0','Reishi',8,1,'[\"morning_and_evening\"]','','100-3,000',0,0.0015,'$v = $QUANTITY;\r\nif($v<=900){\r\n$v = ceil($v/150)*1;\r\n}\r\nelse{\r\n$v = 6+ceil(($v-900)/150)*0.8;\r\n}\r\nreturn $v;',NULL,0.5183,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(80,'0','Boron, Chelate',9,1,'[\"morning_and_evening\"]','','1',0,0.0015,'return ceil($QUANTITY/500)*4;',NULL,0.644,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(81,'0','Calcium, Chelate',9,1,'[\"morning_and_evening\"]','','1,000',0,0.0015,'$v = $QUANTITY;\r\nif($v<=1000){\r\n$v = 10;\r\n}\r\nelse if($v<=2000){\r\n$v = 19;\r\n}\r\nelse if($v<=3000){\r\n$v = 27;\r\n}\r\nelse if($v<=4000){\r\n$v = 34;\r\n}\r\nelse if($v<=5000){\r\n$v = 40;\r\n}\r\nelse{\r\n$v = 40+ceil(($v-5000)/1000)*5;\r\n}\r\nreturn $v;',NULL,0.7693,'$VOLUME * $QUANTITY;',NULL,-120.00000000,''),(82,'0','Chromium, Chelate',9,1,'[\"morning_and_evening\"]','','200',0,0.0000015,'return ceil($QUANTITY/5000)*4;',NULL,0.6827,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(83,'0','Copper',9,1,'[\"morning_and_evening\"]','','2',0,0.0015,'return ceil($QUANTITY/500)*4;',NULL,0.65,'$VOLUME * $QUANTITY;',NULL,-1.20000000,''),(84,'0','Iodine',9,1,'[\"morning_and_evening\"]','','150',0,0.0000015,'return ceil($QUANTITY/5000)*4;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(85,'0','Iron, Chelate',9,1,'[\"morning_and_evening\"]','','M : 0 F : 10',0,0.0015,'return ceil($QUANTITY/500)*4;',NULL,0.7973,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(86,'0','Magnesium, Chelate',9,1,'[\"morning_and_evening\"]','','250',0,0.0015,'return ceil($QUANTITY/500)*4;',NULL,0.757,'$VOLUME * $QUANTITY;',NULL,-120.00000000,''),(87,'0','Manganese, Chelate',9,1,'[\"morning_and_evening\"]','','4',0,0.0015,'return ceil($QUANTITY/500)*4;',NULL,0.677,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(88,'0','Molybdenum, Chelate',9,1,'[\"morning_and_evening\"]','','100',0,0.0000015,'return ceil($QUANTITY/5000)*4;',NULL,0.713,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(89,'0','Phosphorus',9,1,'[\"morning_and_evening\"]','','100',0,0.0015,'return ceil($QUANTITY/500)*4;',NULL,0.698,'$VOLUME * $QUANTITY;',NULL,-120.00000000,''),(90,'0','Potassium ; mg',9,1,'[\"morning_and_evening\"]',NULL,'600',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(91,'0','Selenium, Chelate ; mcg         ',9,1,'[\"morning_and_evening\"]',NULL,'200',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(92,'0','Vanadium, Chelate ; mcg      ',9,1,'[\"morning_and_evening\"]',NULL,'20',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(93,'0','Zinc, Chelate ; mg                                   ',9,1,'[\"morning_and_evening\"]',NULL,'20',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(94,'0','Vitamin A',10,1,'[\"morning_and_evening\"]','','2,000',0,0.00000075,'$v = $QUANTITY;\r\nif($v<=2000){\r\n$v = 2;\r\n}\r\nelse{\r\n$v = 1+ceil($v/2000);\r\n}\r\nreturn $v;',NULL,0.5483,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(95,'0','Thiamin Hydrochloride (B1)',10,1,'[\"morning_and_evening\"]','','10',0,0.0027,'$v = $QUANTITY;\r\nif($v<=500){\r\n$v = 6;\r\n}\r\nelse if($v<=1000){\r\n$v = 10;\r\n}\r\nelse if($v<=1500){\r\n$v = 13;\r\n}\r\nelse if($v<=2000){\r\n$v = 16;\r\n}\r\nelse if($v<=2500){\r\n$v = 19;\r\n}\r\nelse{\r\n$v = 4+ceil($v/500)*3;\r\n}\r\nreturn $v;',NULL,0.622,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(96,'0','Riboflavin-5-Phosphate (B2)',10,1,'[\"morning_and_evening\"]','','5',0,0.0045,'$v = $QUANTITY;\r\nif($v<=500){\r\n$v = 6;\r\n}\r\nelse if($v<=1000){\r\n$v = 10;\r\n}\r\nelse if($v<=1500){\r\n$v = 13;\r\n}\r\nelse if($v<=2000){\r\n$v = 16;\r\n}\r\nelse if($v<=2500){\r\n$v = 19;\r\n}\r\nelse{\r\n$v = 4+ceil($v/500)*3;\r\n}\r\nreturn $v;',NULL,0.5153,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(97,'0','Niacinamide (B3)',10,1,'[\"morning_and_evening\"]','','10',0,0.002,'$v = $QUANTITY;\r\nif($v<=500){\r\n$v = 6;\r\n}\r\nelse if($v<=1000){\r\n$v = 10;\r\n}\r\nelse if($v<=1500){\r\n$v = 13;\r\n}\r\nelse if($v<=2000){\r\n$v = 16;\r\n}\r\nelse if($v<=2500){\r\n$v = 19;\r\n}\r\nelse{\r\n$v = 4+ceil($v/500)*3;\r\n}\r\nreturn $v;',NULL,0.4693,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(98,'0','Calcium-D-Pantothenate (B5)',10,1,'[\"morning_and_evening\"]','','10',0,0.0045,'$v = $QUANTITY;\r\nif($v<=500){\r\n$v = 6;\r\n}\r\nelse if($v<=1000){\r\n$v = 10;\r\n}\r\nelse if($v<=1500){\r\n$v = 13;\r\n}\r\nelse if($v<=2000){\r\n$v = 16;\r\n}\r\nelse if($v<=2500){\r\n$v = 19;\r\n}\r\nelse{\r\n$v = 4+ceil($v/500)*3;\r\n}\r\nreturn $v;',NULL,0.4273,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(99,'0','Pyridoxine Hydrochloride (B6)',10,1,'[\"morning_and_evening\"]','','10',0,0.0025,'$v = $QUANTITY;\r\nif($v<=500){\r\n$v = 6;\r\n}\r\nelse if($v<=1000){\r\n$v = 10;\r\n}\r\nelse if($v<=1500){\r\n$v = 13;\r\n}\r\nelse if($v<=2000){\r\n$v = 16;\r\n}\r\nelse if($v<=2500){\r\n$v = 19;\r\n}\r\nelse{\r\n$v = 4+ceil($v/500)*3;\r\n}\r\nreturn $v;',NULL,0.6313,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(100,'0','Biotin (Vit H)',10,1,'[\"morning_and_evening\"]','','300',0,0.00055,'$v = $QUANTITY;\r\nif($v<=500){\r\n$v = 6;\r\n}\r\nelse if($v<=1000){\r\n$v = 10;\r\n}\r\nelse if($v<=1500){\r\n$v = 13;\r\n}\r\nelse if($v<=2000){\r\n$v = 16;\r\n}\r\nelse if($v<=2500){\r\n$v = 19;\r\n}\r\nelse{\r\n$v = 4+ceil($v/500)*3;\r\n}\r\nreturn $v;',NULL,0.496,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(101,'0','Folic Acid (B9)',10,1,'[\"morning_and_evening\"]','','400',0,0.0000065,'$v = $QUANTITY;\r\nif($v<=500){\r\n$v = 6;\r\n}\r\nelse if($v<=1000){\r\n$v = 10;\r\n}\r\nelse if($v<=1500){\r\n$v = 13;\r\n}\r\nelse if($v<=2000){\r\n$v = 16;\r\n}\r\nelse if($v<=2500){\r\n$v = 19;\r\n}\r\nelse{\r\n$v = 4+ceil($v/500)*3;\r\n}\r\nreturn $v;',NULL,0.4103,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(102,'0','Cyanocobalamin (B12)',10,1,'[\"morning_and_evening\"]','','10',0,0.00055,'$v = $QUANTITY;\r\nif($v<=500){\r\n$v = 6;\r\n}\r\nelse if($v<=1000){\r\n$v = 10;\r\n}\r\nelse if($v<=1500){\r\n$v = 13;\r\n}\r\nelse if($v<=2000){\r\n$v = 16;\r\n}\r\nelse if($v<=2500){\r\n$v = 19;\r\n}\r\nelse{\r\n$v = 4+ceil($v/500)*3;\r\n}\r\nreturn $v;',NULL,0.5473,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(103,'0','Inositol',10,1,'[\"morning_and_evening\"]','','250-500',0,0.0025,'return ceil($QUANTITY/100)*1;',NULL,0.5813,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(104,'0','Vitamin C ; mg',10,1,'[\"morning_and_evening\"]',NULL,'1,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(105,'0','Vitamin D3 ; IU                      ',10,1,'[\"morning_and_evening\"]',NULL,'400',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(106,'0','Vitamin E ; IU',10,1,'[\"morning_and_evening\"]',NULL,'400',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(107,'0','D-Gamma Tocopherol ; IU',10,1,'[\"morning_and_evening\"]',NULL,'100',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(108,'0','Tocotrienol ; mg',10,1,'[\"morning_and_evening\"]',NULL,'100',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(109,'0','Black Ginger Extract',11,1,'[\"morning_and_evening\"]','','500-3,000',0,0.0065,'return ceil($QUANTITY/500)*10;',NULL,0.4297,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(110,'0','Capsicum Extract',11,1,'[\"morning_and_evening\"]','','250-1,500',0,0.001,'return ceil($QUANTITY/200)*1;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(111,'0','Citrin, Garcinia Cambogia',11,1,'[\"morning_and_evening\"]','','250-2,000',0,0.002,'return ceil($QUANTITY/200)*1.5;',NULL,0.64,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(112,'0','Conjugated Linoleic Acids',11,1,'[\"morning_and_evening\"]','','800',0,0.005,'return ceil($QUANTITY/400)*6;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(113,'0','Fabenol, White Kidney Bean',11,1,'[\"morning_and_evening\"]','','100-3,000',0,0.002,'$v = $QUANTITY;\r\nif($v<1500){\r\n$v = ceil($v/100)*1;\r\n}\r\nelse{\r\n$v = ceil($v/100)*0.8;\r\n}\r\nreturn $v;',NULL,0.6563,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(114,'0','Forslean, Coleus Forskohlii',11,1,'[\"morning_and_evening\"]','','50-500',0,0.01,'$v = $QUANTITY;\r\nif($v<=300){\r\n$v = ceil($v/50)*2.5;\r\n}\r\nelse{\r\n$v = 15+ceil(($v-300)/50)*1.8;\r\n}\r\nreturn $v;',NULL,0.505,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(115,'0','Garcinia Extract',11,1,'[\"morning_and_evening\"]','','500-2,800',0,0.0015,'return ceil($QUANTITY/250)*2;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(116,'0','Gaurana',11,1,'[\"morning_and_evening\"]','','150-1,000',0,0.014,'return ceil($QUANTITY/150)*4.5;',NULL,0.579,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(117,'0','Konjac',11,1,'[\"morning_and_evening\"]','','500-3,000',0,0.001,'return ceil($QUANTITY/1000)*5;',NULL,0.5397,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(118,'0','Senna Extract',11,1,'[\"morning_and_evening\"]','','20-30',0,0.0085,'return ceil($QUANTITY/20)*1;',NULL,0.685,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(119,'0','Spirulina ; mg',11,1,'[\"morning_and_evening\"]',NULL,'100-2,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,NULL),(120,'0','Evening Primrose Oil',12,1,'[\"morning_and_evening\"]','','500',0,0.0032,'return ceil($QUANTITY/500)*9;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(121,'0','Fish Oil (EPA180 / DHA120)',12,1,'[\"morning_and_evening\"]','','1,000',0,0.0036,'return ceil($QUANTITY/1000)*8;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(122,'0','Fish Oil (EPA300 / DHA200)',12,1,'[\"morning_and_evening\"]','','1,000',0,1,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(123,'0','Flax Seed Oil',12,1,'[\"morning_and_evening\"]','','1,000',0,0.005,'return ceil($QUANTITY/1000)*11;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(124,'0','Sustained Release Vit C',12,1,'[\"morning_and_evening\"]','','500',0,0.005,'$PRICE * $QUANTITY;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(125,'0','Vitamin K',12,1,'[\"morning_and_evening\"]','','100',0,0.000005,'return ceil($QUANTITY/100)*6;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,''),(126,'0','Whey Protein Isolate',12,1,'[\"morning_and_evening\"]','','31',0,1.1,'return ceil($QUANTITY/31)*42;',NULL,1,'$VOLUME * $QUANTITY;',NULL,0.00000000,'');
/*!40000 ALTER TABLE `products` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `status`
--

DROP TABLE IF EXISTS `status`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `status` (
  `id` int(10) NOT NULL DEFAULT '0',
  `name` varchar(50) DEFAULT NULL,
  `icon` varchar(100) DEFAULT NULL,
  `html` varchar(100) DEFAULT NULL,
  `remark` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `status`
--

LOCK TABLES `status` WRITE;
/*!40000 ALTER TABLE `status` DISABLE KEYS */;
INSERT INTO `status` VALUES (0,'na','negative.gif',NULL,'test'),(1,'draft','action1.gif',NULL,NULL),(2,'request','white_ico.png',NULL,NULL),(3,'pending','new_messages.gif',NULL,NULL),(4,'confirmed','sm_lk6.gif',NULL,NULL),(5,'processing','status_pending.gif',NULL,NULL),(6,'complete','green_ico.png',NULL,NULL),(7,'approved','move2.gif',NULL,NULL),(101,'เตรียม Label',NULL,NULL,'Print Manufacture Sheet'),(102,'เตรียม Packaging',NULL,NULL,'Inventory Check'),(103,'ตรวจสอบ Inventory Check',NULL,NULL,'Recieved by Production'),(104,'ชั่งน้ำหนัก Weighing',NULL,NULL,NULL),(105,'อัดแคปซูล Encapsulation',NULL,NULL,NULL),(106,'บรรจุลงซอง Pre-Packaging',NULL,NULL,NULL),(107,'บรรจุซองลง Packaging',NULL,NULL,NULL),(108,'สินค้าเข้าคลังสินค้าสำเร็จรูป',NULL,NULL,NULL),(109,'สินค้าสำเร็จรูปรอการจัดส่ง',NULL,NULL,NULL),(110,'Complete Processing',NULL,NULL,NULL);
/*!40000 ALTER TABLE `status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `stock_cards`
--

DROP TABLE IF EXISTS `stock_cards`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `stock_cards` (
  `manufacturing_item_id` int(11) NOT NULL,
  `report_time` timestamp NULL DEFAULT NULL,
  `product_id` int(11) DEFAULT NULL,
  `inventory_count` decimal(10,7) DEFAULT NULL,
  `inventory_unit` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`manufacturing_item_id`),
  KEY `manufacturing_stock_card` (`manufacturing_item_id`),
  KEY `stock_card_roduct` (`product_id`),
  CONSTRAINT `manufacturing_stock_card` FOREIGN KEY (`manufacturing_item_id`) REFERENCES `manufacturing_items` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `stock_card_roduct` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Inventory (FIFO)';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `stock_cards`
--

LOCK TABLES `stock_cards` WRITE;
/*!40000 ALTER TABLE `stock_cards` DISABLE KEYS */;
/*!40000 ALTER TABLE `stock_cards` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `transactions`
--

DROP TABLE IF EXISTS `transactions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `transactions` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `uuid` varchar(50) NOT NULL DEFAULT '0',
  `customer_id` int(10) DEFAULT NULL,
  `category` varchar(50) NOT NULL,
  `credit` decimal(20,4) DEFAULT NULL,
  `debit` decimal(20,4) DEFAULT NULL,
  `balance` decimal(20,4) DEFAULT NULL,
  `remarks` varchar(500) DEFAULT NULL,
  `updated` datetime DEFAULT NULL,
  `created` datetime DEFAULT NULL,
  `delivery_date` datetime DEFAULT NULL,
  `payment_date` datetime DEFAULT NULL,
  `due_date` datetime DEFAULT NULL,
  `paid` tinyint(1) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=104 DEFAULT CHARSET=utf8 COMMENT='invoice,payment,deduction';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transactions`
--

LOCK TABLES `transactions` WRITE;
/*!40000 ALTER TABLE `transactions` DISABLE KEYS */;
INSERT INTO `transactions` VALUES (92,'0',2,'1',37450.0000,0.0000,-37450.0000,NULL,'2011-10-18 09:58:50','2011-10-18 09:58:25','2011-10-18 00:00:00',NULL,'2011-11-18 00:00:00',1),(93,'0',2,'2',0.0000,10000.0000,-27450.0000,'','2011-10-18 09:58:50','2011-10-18 09:58:50',NULL,NULL,NULL,NULL),(94,'0',2,'2',0.0000,27450.0000,0.0000,'','2011-10-18 10:00:08','2011-10-18 10:00:08',NULL,NULL,NULL,NULL),(95,'0',2,'1',14766.0000,0.0000,-14766.0000,NULL,'2011-10-18 10:01:05','2011-10-18 10:00:39','2011-10-18 00:00:00',NULL,'2011-11-18 00:00:00',1),(96,'0',2,'2',0.0000,14766.0000,0.0000,'','2011-10-18 10:01:05','2011-10-18 10:01:05',NULL,NULL,NULL,NULL),(97,'0',2,'1',16578.8560,0.0000,-16578.8560,NULL,'2011-11-03 13:11:07','2011-11-03 13:10:25','2011-11-03 00:00:00',NULL,'2011-12-03 00:00:00',1),(98,'0',2,'2',0.0000,16579.0000,0.1440,'','2011-11-03 13:11:07','2011-11-03 13:11:07',NULL,NULL,NULL,NULL),(99,'0',2,'1',6552.0000,0.0000,-6551.8560,NULL,'2011-11-14 18:20:06','2011-11-13 12:29:18','2011-11-13 00:00:00',NULL,'2011-12-13 00:00:00',1),(100,'0',2,'2',0.0000,4555.0000,-1996.8560,'','2011-11-13 14:10:09','2011-11-13 14:10:09',NULL,NULL,NULL,NULL),(101,'0',2,'1',1584.0000,0.0000,-3580.8560,NULL,'2011-11-14 18:20:06','2011-11-14 17:43:26','2011-11-14 00:00:00',NULL,'2011-12-14 00:00:00',1),(102,'0',2,'1',5886.0000,0.0000,-9466.8560,NULL,'2011-11-14 18:20:06','2011-11-14 18:18:02','2011-11-14 00:00:00',NULL,'2011-12-14 00:00:00',1),(103,'0',2,'2',0.0000,9500.0000,33.1440,'','2011-11-14 18:20:06','2011-11-14 18:20:06',NULL,NULL,NULL,NULL);
/*!40000 ALTER TABLE `transactions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_customer`
--

DROP TABLE IF EXISTS `user_customer`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_customer` (
  `user_id` int(11) DEFAULT NULL,
  `customer_id` int(11) DEFAULT NULL,
  `role` varchar(10) DEFAULT NULL,
  KEY `customer_users` (`user_id`),
  KEY `user_customer_id` (`customer_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_customer`
--

LOCK TABLES `user_customer` WRITE;
/*!40000 ALTER TABLE `user_customer` DISABLE KEYS */;
INSERT INTO `user_customer` VALUES (4,12,'OWNER'),(5,13,'OWNER'),(6,14,'OWNER'),(7,15,'OWNER'),(8,16,'OWNER'),(9,17,'OWNER'),(10,18,'OWNER'),(11,19,'OWNER'),(12,20,'OWNER'),(13,21,'OWNER'),(14,22,'OWNER'),(15,23,'OWNER'),(16,24,'OWNER'),(17,25,'OWNER'),(18,26,'OWNER'),(19,27,'OWNER'),(20,28,'OWNER'),(21,29,'OWNER'),(22,30,'OWNER'),(23,31,'OWNER'),(24,32,'OWNER'),(25,33,'OWNER'),(26,34,'OWNER'),(27,35,'OWNER'),(28,36,'OWNER'),(29,37,'OWNER'),(30,38,'OWNER'),(31,39,'OWNER'),(32,40,'OWNER'),(33,41,'OWNER'),(34,42,'OWNER'),(35,43,'OWNER'),(36,44,'OWNER'),(37,45,'OWNER'),(38,46,'OWNER'),(39,47,'OWNER'),(40,48,'OWNER'),(41,49,'OWNER'),(42,50,'OWNER'),(43,51,'OWNER'),(44,52,'OWNER'),(45,53,'OWNER'),(46,54,'OWNER'),(47,55,'OWNER'),(48,56,'OWNER'),(49,57,'OWNER'),(50,58,'OWNER'),(51,59,'OWNER'),(52,60,'OWNER'),(53,61,'OWNER'),(54,62,'OWNER'),(55,63,'OWNER'),(56,64,'OWNER'),(57,65,'OWNER'),(58,66,'OWNER'),(59,67,'OWNER'),(60,68,'OWNER'),(61,69,'OWNER'),(62,70,'OWNER'),(63,71,'OWNER'),(64,72,'OWNER'),(65,73,'OWNER'),(66,74,'OWNER'),(67,75,'OWNER'),(68,76,'OWNER'),(69,77,'OWNER'),(70,78,'OWNER'),(71,79,'OWNER'),(72,80,'OWNER'),(73,81,'OWNER'),(74,82,'OWNER'),(75,83,'OWNER'),(76,84,'OWNER'),(77,85,'OWNER'),(78,86,'OWNER'),(79,87,'OWNER'),(80,88,'OWNER'),(81,89,'OWNER'),(82,90,'OWNER'),(83,91,'OWNER'),(84,92,'OWNER'),(85,93,'OWNER'),(86,94,'OWNER'),(86,95,'OWNER'),(87,96,'OWNER'),(87,97,'OWNER'),(88,98,'OWNER'),(88,99,'OWNER'),(89,100,'OWNER'),(90,101,'OWNER'),(91,102,'OWNER'),(92,103,'OWNER'),(93,104,'OWNER'),(94,105,'OWNER'),(94,106,'OWNER'),(95,107,'OWNER'),(95,108,'OWNER'),(96,109,'OWNER'),(97,110,'OWNER'),(98,111,'OWNER'),(99,112,'OWNER'),(100,113,'OWNER'),(101,114,'OWNER'),(102,115,'OWNER'),(103,116,'OWNER'),(104,117,'OWNER'),(105,118,'OWNER'),(106,119,'OWNER'),(107,120,'OWNER'),(108,121,'OWNER'),(109,122,'OWNER'),(110,123,'OWNER'),(111,124,'OWNER'),(112,125,'OWNER'),(113,126,'OWNER'),(114,127,'OWNER'),(115,128,'OWNER'),(116,129,'OWNER'),(117,130,'OWNER'),(118,131,'OWNER'),(119,132,'OWNER'),(120,133,'OWNER'),(121,134,'OWNER'),(122,135,'OWNER'),(123,136,'OWNER'),(124,137,'OWNER'),(125,138,'OWNER'),(126,139,'OWNER'),(127,140,'OWNER'),(128,141,'OWNER'),(129,142,'OWNER'),(130,143,'OWNER'),(131,144,'OWNER'),(132,145,'OWNER'),(133,146,'OWNER'),(134,147,'OWNER'),(135,148,'OWNER'),(136,149,'OWNER'),(137,150,'OWNER'),(138,151,'OWNER'),(139,152,'OWNER'),(140,153,'OWNER'),(141,154,'OWNER'),(142,155,'OWNER'),(143,156,'OWNER'),(144,157,'OWNER'),(145,158,'OWNER'),(146,159,'OWNER'),(147,160,'OWNER'),(148,161,'OWNER'),(149,162,'OWNER'),(150,163,'OWNER'),(151,164,'OWNER'),(152,165,'OWNER'),(153,166,'OWNER'),(154,167,'OWNER'),(155,168,'OWNER'),(156,169,'OWNER'),(157,170,'OWNER'),(158,171,'OWNER'),(159,172,'OWNER'),(160,173,'OWNER'),(161,174,'OWNER'),(161,175,'OWNER'),(162,176,'OWNER'),(162,177,'OWNER'),(163,178,'OWNER'),(164,179,'OWNER'),(165,180,'OWNER'),(166,181,'OWNER'),(167,182,'OWNER'),(168,183,'OWNER'),(169,184,'OWNER'),(170,185,'OWNER'),(171,186,'OWNER'),(172,187,'OWNER'),(173,188,'OWNER'),(174,189,'OWNER'),(175,190,'OWNER'),(176,191,'OWNER'),(177,192,'OWNER'),(178,193,'OWNER'),(179,194,'OWNER'),(180,195,'OWNER'),(181,196,'OWNER'),(182,197,'OWNER'),(183,198,'OWNER'),(184,199,'OWNER'),(185,200,'OWNER'),(186,201,'OWNER'),(187,202,'OWNER'),(188,203,'OWNER'),(188,204,'OWNER'),(189,205,'OWNER'),(190,206,'OWNER'),(190,207,'OWNER'),(191,208,'OWNER'),(192,209,'OWNER'),(193,210,'OWNER'),(194,211,'OWNER'),(195,212,'OWNER'),(196,213,'OWNER'),(197,214,'OWNER'),(198,215,'OWNER'),(199,216,'OWNER'),(200,217,'OWNER'),(201,218,'OWNER'),(202,219,'OWNER'),(203,220,'OWNER'),(204,221,'OWNER'),(205,222,'OWNER'),(206,223,'OWNER'),(207,224,'OWNER'),(208,225,'OWNER'),(209,226,'OWNER'),(210,227,'OWNER'),(211,228,'OWNER'),(212,229,'OWNER'),(212,230,'OWNER'),(213,231,'OWNER'),(214,232,'OWNER'),(215,233,'OWNER');
/*!40000 ALTER TABLE `user_customer` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_logs`
--

DROP TABLE IF EXISTS `user_logs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_logs` (
  `updated` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `user_id` int(11) NOT NULL,
  `category` varchar(45) DEFAULT NULL,
  `msg` varchar(500) DEFAULT NULL,
  KEY `logs_user` (`user_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='log user activity';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_logs`
--

LOCK TABLES `user_logs` WRITE;
/*!40000 ALTER TABLE `user_logs` DISABLE KEYS */;
INSERT INTO `user_logs` VALUES ('2011-09-01 15:17:34',1,'DELETE_PRODUCT','product id 33 deleted by user 1'),('2011-09-01 15:50:52',1,'PRODUCT_UPDATE','product id 38 created by user 1'),('2011-09-01 15:51:29',1,'PRODUCT_UPDATE','product id 37 deleted by user 1'),('2011-09-01 15:51:36',1,'PRODUCT_UPDATE','product id 38 deleted by user 1'),('2011-09-01 15:51:43',1,'PRODUCT_UPDATE','product id 36 deleted by user 1'),('2011-09-01 16:38:52',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-09-19 13:17:57',1,'PRODUCT_UPDATE','product id 10 updated by user 1'),('2011-09-19 13:18:09',1,'PRODUCT_UPDATE','product id 10 updated by user 1'),('2011-10-07 16:07:07',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-10-16 06:56:03',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-10-16 06:56:23',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-10-16 06:58:25',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-10-18 01:48:56',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-10-24 15:38:11',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-10-24 15:38:42',1,'PRODUCT_UPDATE','product id 94 updated by user 1'),('2011-10-24 15:50:47',1,'PRODUCT_UPDATE','product id 94 updated by user 1'),('2011-10-24 16:01:32',1,'PRODUCT_UPDATE','product id 94 updated by user 1'),('2011-10-24 16:04:07',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-10-24 16:05:18',1,'PRODUCT_UPDATE','product id 2 updated by user 1'),('2011-10-24 16:07:15',1,'PRODUCT_UPDATE','product id 3 updated by user 1'),('2011-10-24 16:08:58',1,'PRODUCT_UPDATE','product id 4 updated by user 1'),('2011-10-24 16:09:18',1,'PRODUCT_UPDATE','product id 5 updated by user 1'),('2011-10-24 16:09:37',1,'PRODUCT_UPDATE','product id 6 updated by user 1'),('2011-10-24 16:10:00',1,'PRODUCT_UPDATE','product id 7 updated by user 1'),('2011-10-24 16:10:16',1,'PRODUCT_UPDATE','product id 8 updated by user 1'),('2011-10-24 16:10:44',1,'PRODUCT_UPDATE','product id 9 updated by user 1'),('2011-10-24 16:11:21',1,'PRODUCT_UPDATE','product id 10 updated by user 1'),('2011-10-24 16:12:08',1,'PRODUCT_UPDATE','product id 14 updated by user 1'),('2011-10-24 16:12:30',1,'PRODUCT_UPDATE','product id 15 updated by user 1'),('2011-10-24 16:12:50',1,'PRODUCT_UPDATE','product id 16 updated by user 1'),('2011-10-24 16:13:26',1,'PRODUCT_UPDATE','product id 17 updated by user 1'),('2011-10-24 16:14:11',1,'PRODUCT_UPDATE','product id 18 updated by user 1'),('2011-10-24 16:14:44',1,'PRODUCT_UPDATE','product id 19 updated by user 1'),('2011-10-24 16:15:02',1,'PRODUCT_UPDATE','product id 20 updated by user 1'),('2011-10-24 16:15:44',1,'PRODUCT_UPDATE','product id 21 updated by user 1'),('2011-10-24 16:16:02',1,'PRODUCT_UPDATE','product id 22 updated by user 1'),('2011-10-24 16:16:23',1,'PRODUCT_UPDATE','product id 23 updated by user 1'),('2011-10-24 16:16:50',1,'PRODUCT_UPDATE','product id 26 updated by user 1'),('2011-10-24 16:17:23',1,'PRODUCT_UPDATE','product id 27 updated by user 1'),('2011-10-24 16:18:07',1,'PRODUCT_UPDATE','product id 28 updated by user 1'),('2011-10-24 16:18:26',1,'PRODUCT_UPDATE','product id 29 updated by user 1'),('2011-10-24 16:19:32',1,'PRODUCT_UPDATE','product id 31 updated by user 1'),('2011-10-24 16:20:51',1,'PRODUCT_UPDATE','product id 32 updated by user 1'),('2011-10-24 16:21:12',1,'PRODUCT_UPDATE','product id 33 updated by user 1'),('2011-10-24 16:21:36',1,'PRODUCT_UPDATE','product id 34 updated by user 1'),('2011-10-24 16:21:57',1,'PRODUCT_UPDATE','product id 35 updated by user 1'),('2011-10-24 16:22:18',1,'PRODUCT_UPDATE','product id 36 updated by user 1'),('2011-10-24 16:22:45',1,'PRODUCT_UPDATE','product id 37 updated by user 1'),('2011-10-24 16:23:08',1,'PRODUCT_UPDATE','product id 38 updated by user 1'),('2011-10-24 16:23:31',1,'PRODUCT_UPDATE','product id 39 updated by user 1'),('2011-10-24 16:24:01',1,'PRODUCT_UPDATE','product id 40 updated by user 1'),('2011-10-24 16:24:26',1,'PRODUCT_UPDATE','product id 41 updated by user 1'),('2011-10-24 16:24:54',1,'PRODUCT_UPDATE','product id 42 updated by user 1'),('2011-10-24 16:25:15',1,'PRODUCT_UPDATE','product id 43 updated by user 1'),('2011-10-24 16:26:24',1,'PRODUCT_UPDATE','product id 45 updated by user 1'),('2011-10-24 16:29:15',1,'PRODUCT_UPDATE','product id 76 updated by user 1'),('2011-10-24 16:29:36',1,'PRODUCT_UPDATE','product id 77 updated by user 1'),('2011-10-24 16:30:56',1,'PRODUCT_UPDATE','product id 79 updated by user 1'),('2011-10-24 16:31:30',1,'PRODUCT_UPDATE','product id 80 updated by user 1'),('2011-10-24 16:31:49',1,'PRODUCT_UPDATE','product id 81 updated by user 1'),('2011-10-24 16:32:05',1,'PRODUCT_UPDATE','product id 82 updated by user 1'),('2011-10-24 16:32:22',1,'PRODUCT_UPDATE','product id 83 updated by user 1'),('2011-10-24 16:33:21',1,'PRODUCT_UPDATE','product id 85 updated by user 1'),('2011-10-24 16:33:49',1,'PRODUCT_UPDATE','product id 86 updated by user 1'),('2011-10-24 16:34:10',1,'PRODUCT_UPDATE','product id 87 updated by user 1'),('2011-10-24 16:34:31',1,'PRODUCT_UPDATE','product id 88 updated by user 1'),('2011-10-24 16:34:57',1,'PRODUCT_UPDATE','product id 89 updated by user 1'),('2011-10-24 16:36:57',1,'PRODUCT_UPDATE','product id 95 updated by user 1'),('2011-10-24 16:37:22',1,'PRODUCT_UPDATE','product id 96 updated by user 1'),('2011-10-24 16:37:41',1,'PRODUCT_UPDATE','product id 97 updated by user 1'),('2011-10-24 16:38:07',1,'PRODUCT_UPDATE','product id 98 updated by user 1'),('2011-10-24 16:38:36',1,'PRODUCT_UPDATE','product id 99 updated by user 1'),('2011-10-24 16:39:08',1,'PRODUCT_UPDATE','product id 100 updated by user 1'),('2011-10-24 16:39:31',1,'PRODUCT_UPDATE','product id 101 updated by user 1'),('2011-10-24 16:39:54',1,'PRODUCT_UPDATE','product id 102 updated by user 1'),('2011-10-24 16:40:29',1,'PRODUCT_UPDATE','product id 103 updated by user 1'),('2011-10-24 16:41:17',1,'PRODUCT_UPDATE','product id 109 updated by user 1'),('2011-10-24 16:41:39',1,'PRODUCT_UPDATE','product id 110 updated by user 1'),('2011-10-24 16:42:13',1,'PRODUCT_UPDATE','product id 111 updated by user 1'),('2011-10-24 16:43:28',1,'PRODUCT_UPDATE','product id 113 updated by user 1'),('2011-10-24 16:43:55',1,'PRODUCT_UPDATE','product id 114 updated by user 1'),('2011-10-24 16:44:13',1,'PRODUCT_UPDATE','product id 116 updated by user 1'),('2011-10-24 16:44:30',1,'PRODUCT_UPDATE','product id 117 updated by user 1'),('2011-10-24 16:45:05',1,'PRODUCT_UPDATE','product id 118 updated by user 1'),('2011-10-24 16:46:44',1,'PRODUCT_UPDATE','product id 94 updated by user 1'),('2011-10-25 18:19:30',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-10-25 18:41:56',1,'PRODUCT_UPDATE','product id 2 updated by user 1'),('2011-10-29 13:07:46',1,'PRODUCT_UPDATE','product id 3 updated by user 1'),('2011-10-29 13:08:53',1,'PRODUCT_UPDATE','product id 4 updated by user 1'),('2011-10-29 13:09:32',1,'PRODUCT_UPDATE','product id 5 updated by user 1'),('2011-10-29 13:10:05',1,'PRODUCT_UPDATE','product id 6 updated by user 1'),('2011-10-29 13:10:34',1,'PRODUCT_UPDATE','product id 7 updated by user 1'),('2011-10-29 13:11:09',1,'PRODUCT_UPDATE','product id 8 updated by user 1'),('2011-10-29 13:11:38',1,'PRODUCT_UPDATE','product id 9 updated by user 1'),('2011-10-29 13:12:21',1,'PRODUCT_UPDATE','product id 10 updated by user 1'),('2011-10-29 13:12:51',1,'PRODUCT_UPDATE','product id 14 updated by user 1'),('2011-10-29 13:13:12',1,'PRODUCT_UPDATE','product id 15 updated by user 1'),('2011-10-29 13:13:36',1,'PRODUCT_UPDATE','product id 16 updated by user 1'),('2011-10-29 13:13:57',1,'PRODUCT_UPDATE','product id 17 updated by user 1'),('2011-10-29 13:14:21',1,'PRODUCT_UPDATE','product id 18 updated by user 1'),('2011-10-29 13:14:47',1,'PRODUCT_UPDATE','product id 19 updated by user 1'),('2011-10-29 13:15:10',1,'PRODUCT_UPDATE','product id 20 updated by user 1'),('2011-10-29 13:15:38',1,'PRODUCT_UPDATE','product id 21 updated by user 1'),('2011-10-29 13:16:12',1,'PRODUCT_UPDATE','product id 22 updated by user 1'),('2011-10-29 13:16:51',1,'PRODUCT_UPDATE','product id 23 updated by user 1'),('2011-10-29 13:17:15',1,'PRODUCT_UPDATE','product id 26 updated by user 1'),('2011-10-29 13:17:40',1,'PRODUCT_UPDATE','product id 27 updated by user 1'),('2011-10-29 13:18:18',1,'PRODUCT_UPDATE','product id 28 updated by user 1'),('2011-10-29 13:18:37',1,'PRODUCT_UPDATE','product id 29 updated by user 1'),('2011-10-29 13:19:06',1,'PRODUCT_UPDATE','product id 30 updated by user 1'),('2011-10-29 13:19:33',1,'PRODUCT_UPDATE','product id 31 updated by user 1'),('2011-10-29 13:19:52',1,'PRODUCT_UPDATE','product id 32 updated by user 1'),('2011-10-29 13:20:20',1,'PRODUCT_UPDATE','product id 33 updated by user 1'),('2011-10-29 13:20:51',1,'PRODUCT_UPDATE','product id 34 updated by user 1'),('2011-10-29 13:21:19',1,'PRODUCT_UPDATE','product id 35 updated by user 1'),('2011-10-29 13:21:49',1,'PRODUCT_UPDATE','product id 36 updated by user 1'),('2011-10-29 13:22:12',1,'PRODUCT_UPDATE','product id 37 updated by user 1'),('2011-10-29 13:22:35',1,'PRODUCT_UPDATE','product id 38 updated by user 1'),('2011-10-29 13:23:06',1,'PRODUCT_UPDATE','product id 39 updated by user 1'),('2011-10-29 13:23:33',1,'PRODUCT_UPDATE','product id 40 updated by user 1'),('2011-10-29 13:24:04',1,'PRODUCT_UPDATE','product id 41 updated by user 1'),('2011-10-29 13:24:28',1,'PRODUCT_UPDATE','product id 42 updated by user 1'),('2011-10-29 13:24:58',1,'PRODUCT_UPDATE','product id 43 updated by user 1'),('2011-10-29 13:27:00',1,'PRODUCT_UPDATE','product id 45 updated by user 1'),('2011-10-29 13:40:50',1,'PRODUCT_UPDATE','product id 76 updated by user 1'),('2011-10-29 13:41:14',1,'PRODUCT_UPDATE','product id 77 updated by user 1'),('2011-10-29 13:42:08',1,'PRODUCT_UPDATE','product id 79 updated by user 1'),('2011-10-29 13:42:46',1,'PRODUCT_UPDATE','product id 80 updated by user 1'),('2011-10-29 13:43:24',1,'PRODUCT_UPDATE','product id 81 updated by user 1'),('2011-10-29 13:43:48',1,'PRODUCT_UPDATE','product id 82 updated by user 1'),('2011-10-29 13:44:20',1,'PRODUCT_UPDATE','product id 83 updated by user 1'),('2011-10-29 13:44:48',1,'PRODUCT_UPDATE','product id 84 updated by user 1'),('2011-10-29 13:45:12',1,'PRODUCT_UPDATE','product id 85 updated by user 1'),('2011-10-29 13:45:44',1,'PRODUCT_UPDATE','product id 86 updated by user 1'),('2011-10-29 13:46:09',1,'PRODUCT_UPDATE','product id 87 updated by user 1'),('2011-10-29 13:46:34',1,'PRODUCT_UPDATE','product id 88 updated by user 1'),('2011-10-29 13:47:02',1,'PRODUCT_UPDATE','product id 89 updated by user 1'),('2011-10-29 13:48:43',1,'PRODUCT_UPDATE','product id 94 updated by user 1'),('2011-10-29 13:50:45',1,'PRODUCT_UPDATE','product id 95 updated by user 1'),('2011-10-29 13:52:32',1,'PRODUCT_UPDATE','product id 96 updated by user 1'),('2011-10-29 13:52:54',1,'PRODUCT_UPDATE','product id 97 updated by user 1'),('2011-10-29 13:53:18',1,'PRODUCT_UPDATE','product id 98 updated by user 1'),('2011-10-29 13:53:41',1,'PRODUCT_UPDATE','product id 99 updated by user 1'),('2011-10-29 13:54:06',1,'PRODUCT_UPDATE','product id 100 updated by user 1'),('2011-10-29 13:54:29',1,'PRODUCT_UPDATE','product id 101 updated by user 1'),('2011-10-29 13:54:54',1,'PRODUCT_UPDATE','product id 102 updated by user 1'),('2011-10-29 13:55:15',1,'PRODUCT_UPDATE','product id 103 updated by user 1'),('2011-10-29 13:55:51',1,'PRODUCT_UPDATE','product id 109 updated by user 1'),('2011-10-29 13:56:17',1,'PRODUCT_UPDATE','product id 110 updated by user 1'),('2011-10-29 14:01:44',1,'PRODUCT_UPDATE','product id 111 updated by user 1'),('2011-10-29 14:02:21',1,'PRODUCT_UPDATE','product id 112 updated by user 1'),('2011-10-29 14:02:48',1,'PRODUCT_UPDATE','product id 113 updated by user 1'),('2011-10-29 14:03:16',1,'PRODUCT_UPDATE','product id 114 updated by user 1'),('2011-10-29 14:03:46',1,'PRODUCT_UPDATE','product id 115 updated by user 1'),('2011-10-29 14:04:13',1,'PRODUCT_UPDATE','product id 116 updated by user 1'),('2011-10-29 14:04:38',1,'PRODUCT_UPDATE','product id 117 updated by user 1'),('2011-10-29 14:05:13',1,'PRODUCT_UPDATE','product id 118 updated by user 1'),('2011-10-29 14:05:33',1,'PRODUCT_UPDATE','product id 120 updated by user 1'),('2011-10-29 14:05:53',1,'PRODUCT_UPDATE','product id 121 updated by user 1'),('2011-10-29 14:06:34',1,'PRODUCT_UPDATE','product id 123 updated by user 1'),('2011-10-29 14:06:54',1,'PRODUCT_UPDATE','product id 124 updated by user 1'),('2011-10-29 14:07:10',1,'PRODUCT_UPDATE','product id 125 updated by user 1'),('2011-10-29 14:07:27',1,'PRODUCT_UPDATE','product id 126 updated by user 1'),('2011-10-29 14:07:44',1,'PRODUCT_UPDATE','product id 126 updated by user 1'),('2011-11-03 04:38:41',1,'PRODUCT_UPDATE','product id 2 updated by user 1'),('2011-11-03 04:40:05',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-11-03 04:40:51',1,'PRODUCT_UPDATE','product id 3 updated by user 1'),('2011-11-03 04:41:54',1,'PRODUCT_UPDATE','product id 4 updated by user 1'),('2011-11-03 04:42:52',1,'PRODUCT_UPDATE','product id 5 updated by user 1'),('2011-11-03 04:43:42',1,'PRODUCT_UPDATE','product id 6 updated by user 1'),('2011-11-03 04:44:32',1,'PRODUCT_UPDATE','product id 7 updated by user 1'),('2011-11-03 04:45:18',1,'PRODUCT_UPDATE','product id 8 updated by user 1'),('2011-11-03 04:49:45',1,'PRODUCT_UPDATE','product id 9 updated by user 1'),('2011-11-03 04:51:43',1,'PRODUCT_UPDATE','product id 10 updated by user 1'),('2011-11-03 04:57:17',1,'PRODUCT_UPDATE','product id 14 updated by user 1'),('2011-11-03 04:58:33',1,'PRODUCT_UPDATE','product id 15 updated by user 1'),('2011-11-03 04:59:28',1,'PRODUCT_UPDATE','product id 16 updated by user 1'),('2011-11-03 05:00:06',1,'PRODUCT_UPDATE','product id 17 updated by user 1'),('2011-11-03 05:00:44',1,'PRODUCT_UPDATE','product id 18 updated by user 1'),('2011-11-03 05:01:19',1,'PRODUCT_UPDATE','product id 19 updated by user 1'),('2011-11-03 05:01:59',1,'PRODUCT_UPDATE','product id 20 updated by user 1'),('2011-11-03 05:02:56',1,'PRODUCT_UPDATE','product id 21 updated by user 1'),('2011-11-03 05:07:05',1,'PRODUCT_UPDATE','product id 22 updated by user 1'),('2011-11-03 05:09:00',1,'PRODUCT_UPDATE','product id 26 updated by user 1'),('2011-11-03 05:09:47',1,'PRODUCT_UPDATE','product id 27 updated by user 1'),('2011-11-03 05:11:05',1,'PRODUCT_UPDATE','product id 28 updated by user 1'),('2011-11-03 05:12:34',1,'PRODUCT_UPDATE','product id 29 updated by user 1'),('2011-11-03 05:13:40',1,'PRODUCT_UPDATE','product id 30 updated by user 1'),('2011-11-03 05:14:36',1,'PRODUCT_UPDATE','product id 31 updated by user 1'),('2011-11-03 05:15:33',1,'PRODUCT_UPDATE','product id 32 updated by user 1'),('2011-11-03 05:16:13',1,'PRODUCT_UPDATE','product id 33 updated by user 1'),('2011-11-03 05:17:26',1,'PRODUCT_UPDATE','product id 34 updated by user 1'),('2011-11-03 05:18:13',1,'PRODUCT_UPDATE','product id 35 updated by user 1'),('2011-11-03 05:19:12',1,'PRODUCT_UPDATE','product id 36 updated by user 1'),('2011-11-03 05:25:40',1,'PRODUCT_UPDATE','product id 77 updated by user 1'),('2011-11-03 05:28:58',1,'PRODUCT_UPDATE','product id 79 updated by user 1'),('2011-11-03 05:29:41',1,'PRODUCT_UPDATE','product id 80 updated by user 1'),('2011-11-03 05:33:20',1,'PRODUCT_UPDATE','product id 81 updated by user 1'),('2011-11-03 05:34:02',1,'PRODUCT_UPDATE','product id 82 updated by user 1'),('2011-11-03 05:34:37',1,'PRODUCT_UPDATE','product id 83 updated by user 1'),('2011-11-03 05:35:17',1,'PRODUCT_UPDATE','product id 84 updated by user 1'),('2011-11-03 05:35:48',1,'PRODUCT_UPDATE','product id 85 updated by user 1'),('2011-11-03 05:37:04',1,'PRODUCT_UPDATE','product id 86 updated by user 1'),('2011-11-03 05:37:30',1,'PRODUCT_UPDATE','product id 87 updated by user 1'),('2011-11-03 05:38:02',1,'PRODUCT_UPDATE','product id 88 updated by user 1'),('2011-11-03 05:40:38',1,'PRODUCT_UPDATE','product id 89 updated by user 1'),('2011-11-03 05:42:17',1,'PRODUCT_UPDATE','product id 94 updated by user 1'),('2011-11-03 05:50:19',1,'PRODUCT_UPDATE','product id 95 updated by user 1'),('2011-11-03 05:50:40',1,'PRODUCT_UPDATE','product id 96 updated by user 1'),('2011-11-03 05:51:23',1,'PRODUCT_UPDATE','product id 97 updated by user 1'),('2011-11-03 05:51:45',1,'PRODUCT_UPDATE','product id 98 updated by user 1'),('2011-11-03 05:52:05',1,'PRODUCT_UPDATE','product id 99 updated by user 1'),('2011-11-03 05:52:22',1,'PRODUCT_UPDATE','product id 100 updated by user 1'),('2011-11-03 05:52:32',1,'PRODUCT_UPDATE','product id 101 updated by user 1'),('2011-11-03 05:53:22',1,'PRODUCT_UPDATE','product id 102 updated by user 1'),('2011-11-03 05:54:23',1,'PRODUCT_UPDATE','product id 103 updated by user 1'),('2011-11-03 05:55:23',1,'PRODUCT_UPDATE','product id 109 updated by user 1'),('2011-11-03 05:56:03',1,'PRODUCT_UPDATE','product id 110 updated by user 1'),('2011-11-03 05:56:45',1,'PRODUCT_UPDATE','product id 111 updated by user 1'),('2011-11-03 05:57:25',1,'PRODUCT_UPDATE','product id 112 updated by user 1'),('2011-11-03 05:59:51',1,'PRODUCT_UPDATE','product id 114 updated by user 1'),('2011-11-03 06:01:58',1,'PRODUCT_UPDATE','product id 113 updated by user 1'),('2011-11-03 06:02:34',1,'PRODUCT_UPDATE','product id 115 updated by user 1'),('2011-11-03 06:03:17',1,'PRODUCT_UPDATE','product id 116 updated by user 1'),('2011-11-03 06:04:05',1,'PRODUCT_UPDATE','product id 117 updated by user 1'),('2011-11-03 06:05:14',1,'PRODUCT_UPDATE','product id 118 updated by user 1'),('2011-11-03 06:05:51',1,'PRODUCT_UPDATE','product id 120 updated by user 1'),('2011-11-03 06:06:33',1,'PRODUCT_UPDATE','product id 121 updated by user 1'),('2011-11-03 06:07:29',1,'PRODUCT_UPDATE','product id 123 updated by user 1'),('2011-11-03 06:08:06',1,'PRODUCT_UPDATE','product id 125 updated by user 1'),('2011-11-03 06:08:45',1,'PRODUCT_UPDATE','product id 126 updated by user 1'),('2011-11-12 17:44:17',1,'PRODUCT_UPDATE','product id 1 updated by user 1'),('2011-11-12 17:44:30',1,'PRODUCT_UPDATE','product id 2 updated by user 1'),('2011-11-13 06:09:50',1,'PRODUCT_UPDATE','product id 3 updated by user 1'),('2011-11-13 06:10:10',1,'PRODUCT_UPDATE','product id 4 updated by user 1'),('2011-11-13 06:10:38',1,'PRODUCT_UPDATE','product id 5 updated by user 1'),('2011-11-13 06:22:33',1,'PRODUCT_UPDATE','product id 7 updated by user 1'),('2011-11-13 06:22:46',1,'PRODUCT_UPDATE','product id 6 updated by user 1'),('2011-11-13 06:22:56',1,'PRODUCT_UPDATE','product id 8 updated by user 1'),('2011-11-13 06:23:06',1,'PRODUCT_UPDATE','product id 9 updated by user 1'),('2011-11-13 06:23:20',1,'PRODUCT_UPDATE','product id 10 updated by user 1'),('2011-11-13 06:24:42',1,'PRODUCT_UPDATE','product id 14 updated by user 1'),('2011-11-13 06:24:53',1,'PRODUCT_UPDATE','product id 15 updated by user 1'),('2011-11-13 06:25:03',1,'PRODUCT_UPDATE','product id 16 updated by user 1'),('2011-11-13 06:25:26',1,'PRODUCT_UPDATE','product id 17 updated by user 1'),('2011-11-13 06:25:53',1,'PRODUCT_UPDATE','product id 18 updated by user 1'),('2011-11-13 06:26:02',1,'PRODUCT_UPDATE','product id 20 updated by user 1'),('2011-11-13 06:26:15',1,'PRODUCT_UPDATE','product id 19 updated by user 1'),('2011-11-13 06:26:25',1,'PRODUCT_UPDATE','product id 21 updated by user 1'),('2011-11-13 06:26:35',1,'PRODUCT_UPDATE','product id 22 updated by user 1'),('2011-11-13 06:27:00',1,'PRODUCT_UPDATE','product id 23 updated by user 1'),('2011-11-13 06:27:10',1,'PRODUCT_UPDATE','product id 26 updated by user 1'),('2011-11-13 06:27:21',1,'PRODUCT_UPDATE','product id 27 updated by user 1'),('2011-11-13 06:27:30',1,'PRODUCT_UPDATE','product id 28 updated by user 1'),('2011-11-13 06:27:40',1,'PRODUCT_UPDATE','product id 29 updated by user 1'),('2011-11-13 06:27:50',1,'PRODUCT_UPDATE','product id 30 updated by user 1'),('2011-11-13 06:27:58',1,'PRODUCT_UPDATE','product id 34 updated by user 1'),('2011-11-13 06:28:09',1,'PRODUCT_UPDATE','product id 31 updated by user 1'),('2011-11-13 06:28:17',1,'PRODUCT_UPDATE','product id 32 updated by user 1'),('2011-11-13 06:28:25',1,'PRODUCT_UPDATE','product id 33 updated by user 1'),('2011-11-13 06:28:40',1,'PRODUCT_UPDATE','product id 35 updated by user 1'),('2011-11-13 06:28:54',1,'PRODUCT_UPDATE','product id 36 updated by user 1'),('2011-11-13 06:29:06',1,'PRODUCT_UPDATE','product id 37 updated by user 1'),('2011-11-13 06:29:18',1,'PRODUCT_UPDATE','product id 38 updated by user 1'),('2011-11-13 06:29:26',1,'PRODUCT_UPDATE','product id 39 updated by user 1'),('2011-11-13 06:29:35',1,'PRODUCT_UPDATE','product id 40 updated by user 1'),('2011-11-13 06:29:58',1,'PRODUCT_UPDATE','product id 41 updated by user 1'),('2011-11-13 06:30:06',1,'PRODUCT_UPDATE','product id 42 updated by user 1'),('2011-11-13 06:30:16',1,'PRODUCT_UPDATE','product id 43 updated by user 1'),('2011-11-13 06:30:28',1,'PRODUCT_UPDATE','product id 44 updated by user 1'),('2011-11-13 06:30:38',1,'PRODUCT_UPDATE','product id 45 updated by user 1'),('2011-11-13 06:33:25',1,'PRODUCT_UPDATE','product id 68 updated by user 1'),('2011-11-13 06:33:35',1,'PRODUCT_UPDATE','product id 69 updated by user 1'),('2011-11-13 06:33:43',1,'PRODUCT_UPDATE','product id 70 updated by user 1'),('2011-11-13 06:33:51',1,'PRODUCT_UPDATE','product id 71 updated by user 1'),('2011-11-13 06:33:59',1,'PRODUCT_UPDATE','product id 72 updated by user 1'),('2011-11-13 06:34:07',1,'PRODUCT_UPDATE','product id 73 updated by user 1'),('2011-11-13 06:34:17',1,'PRODUCT_UPDATE','product id 74 updated by user 1'),('2011-11-13 06:34:27',1,'PRODUCT_UPDATE','product id 75 updated by user 1'),('2011-11-13 06:36:35',1,'PRODUCT_UPDATE','product id 76 updated by user 1'),('2011-11-13 06:36:50',1,'PRODUCT_UPDATE','product id 77 updated by user 1'),('2011-11-13 06:37:01',1,'PRODUCT_UPDATE','product id 78 updated by user 1'),('2011-11-13 06:37:14',1,'PRODUCT_UPDATE','product id 79 updated by user 1'),('2011-11-13 06:37:25',1,'PRODUCT_UPDATE','product id 80 updated by user 1'),('2011-11-13 06:37:36',1,'PRODUCT_UPDATE','product id 81 updated by user 1'),('2011-11-13 06:37:45',1,'PRODUCT_UPDATE','product id 82 updated by user 1'),('2011-11-13 06:37:53',1,'PRODUCT_UPDATE','product id 83 updated by user 1'),('2011-11-13 06:38:02',1,'PRODUCT_UPDATE','product id 84 updated by user 1'),('2011-11-13 06:39:26',1,'PRODUCT_UPDATE','product id 85 updated by user 1'),('2011-11-13 06:40:14',1,'PRODUCT_UPDATE','product id 86 updated by user 1'),('2011-11-13 06:40:23',1,'PRODUCT_UPDATE','product id 87 updated by user 1'),('2011-11-13 06:40:40',1,'PRODUCT_UPDATE','product id 88 updated by user 1'),('2011-11-13 06:40:50',1,'PRODUCT_UPDATE','product id 89 updated by user 1'),('2011-11-13 06:41:44',1,'PRODUCT_UPDATE','product id 94 updated by user 1'),('2011-11-13 06:42:06',1,'PRODUCT_UPDATE','product id 95 updated by user 1'),('2011-11-13 06:42:19',1,'PRODUCT_UPDATE','product id 96 updated by user 1'),('2011-11-13 06:46:56',1,'PRODUCT_UPDATE','product id 98 updated by user 1'),('2011-11-13 06:47:12',1,'PRODUCT_UPDATE','product id 97 updated by user 1'),('2011-11-13 06:47:30',1,'PRODUCT_UPDATE','product id 99 updated by user 1'),('2011-11-13 06:47:44',1,'PRODUCT_UPDATE','product id 100 updated by user 1'),('2011-11-13 06:48:11',1,'PRODUCT_UPDATE','product id 101 updated by user 1'),('2011-11-13 06:48:23',1,'PRODUCT_UPDATE','product id 102 updated by user 1'),('2011-11-13 06:48:32',1,'PRODUCT_UPDATE','product id 103 updated by user 1'),('2011-11-13 06:48:40',1,'PRODUCT_UPDATE','product id 109 updated by user 1'),('2011-11-13 06:48:50',1,'PRODUCT_UPDATE','product id 110 updated by user 1'),('2011-11-13 06:48:59',1,'PRODUCT_UPDATE','product id 111 updated by user 1'),('2011-11-13 06:49:09',1,'PRODUCT_UPDATE','product id 112 updated by user 1'),('2011-11-13 06:49:22',1,'PRODUCT_UPDATE','product id 113 updated by user 1'),('2011-11-13 06:49:31',1,'PRODUCT_UPDATE','product id 114 updated by user 1'),('2011-11-13 06:49:47',1,'PRODUCT_UPDATE','product id 115 updated by user 1'),('2011-11-13 06:49:58',1,'PRODUCT_UPDATE','product id 116 updated by user 1'),('2011-11-13 06:50:08',1,'PRODUCT_UPDATE','product id 117 updated by user 1'),('2011-11-13 06:50:17',1,'PRODUCT_UPDATE','product id 118 updated by user 1'),('2011-11-13 06:50:26',1,'PRODUCT_UPDATE','product id 120 updated by user 1'),('2011-11-13 06:51:06',1,'PRODUCT_UPDATE','product id 124 updated by user 1'),('2011-11-13 06:51:17',1,'PRODUCT_UPDATE','product id 125 updated by user 1'),('2011-11-13 06:51:33',1,'PRODUCT_UPDATE','product id 126 updated by user 1'),('2011-11-13 06:51:51',1,'PRODUCT_UPDATE','product id 123 updated by user 1'),('2011-11-13 06:52:15',1,'PRODUCT_UPDATE','product id 121 updated by user 1'),('2011-11-13 06:52:27',1,'PRODUCT_UPDATE','product id 122 updated by user 1');
/*!40000 ALTER TABLE `user_logs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_pin`
--

DROP TABLE IF EXISTS `user_pin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_pin` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `user_id` bigint(20) NOT NULL,
  `pin` varchar(4) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `pin` (`pin`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_pin`
--

LOCK TABLES `user_pin` WRITE;
/*!40000 ALTER TABLE `user_pin` DISABLE KEYS */;
INSERT INTO `user_pin` VALUES (1,12,'0123'),(2,1,'8888'),(3,0,'04');
/*!40000 ALTER TABLE `user_pin` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(45) NOT NULL,
  `display_name` varchar(45) NOT NULL,
  `full_name` varchar(45) DEFAULT NULL,
  `password` varchar(45) NOT NULL,
  `salt` varchar(45) NOT NULL DEFAULT '1234',
  `email` varchar(45) DEFAULT NULL,
  `type` char(15) NOT NULL DEFAULT 'GUEST',
  `inactive` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=MyISAM AUTO_INCREMENT=218 DEFAULT CHARSET=utf8 COMMENT='system user';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'admin','Admin','Admin Person','7ae645779febb0db1a1b7c7221a9c718','1234','ksupasak@gmail.com','ADMIN',0),(216,'clinician','Test Clinician','นพ. ทดสอบ','7ae645779febb0db1a1b7c7221a9c718','1234','ksupasak@gmail.com','CLINICIAN',0),(217,'manufacture','manufacture','manufacture','7ae645779febb0db1a1b7c7221a9c718','1234','manufacture@gmail.com','MANUFACTURE',0);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2011-11-15  0:09:13
